import 'package:flutter/material.dart';

import '../Objects/Asr.dart';
import '../Objects/Dhuhr.dart';
import '../Objects/Fajr.dart';
import '../Objects/General.dart';
import '../Objects/Isha.dart';
import '../Objects/Maghrib.dart';

// calculate2023RamdanDate() {
//   Map<int, int> EngToRamadan = {
//     24: 1,
//     25: 2,
//     26: 3,
//     27: 4,
//     28: 5,
//     29: 6,
//     30: 7,
//     31: 8,
//     1: 9,
//     2: 10,
//     3: 11,
//     4: 12,
//     5: 13,
//     6: 14,
//     7: 15,
//     8: 16,
//     9: 17,
//     10: 18,
//     11: 19,
//     12: 20,
//     13: 21,
//     14: 22,
//     15: 23,
//     16: 24,
//     17: 25,
//     18: 26,
//     19: 27,
//     20: 28,
//     21: 29,
//     22: 30,
//   };
//   var hour = DateTime.now().hour;
//   var date = DateTime.now().day;
//   var minute = DateTime.now().minute;
//   // var hour = 18;
//   // var minute = 49;
//   // var date = 17;
//   // var ampm = DateTime.now().hour >= 12 ? 'PM' : 'AM';
//   if ((hour >= 18)) {
//     if (hour == 18 && (minute >= 0 && minute <= 45)) {
//       return EngToRamadan[date]!;
//     } else {
//       return EngToRamadan[date]! + 1;
//     }
//   } else {
//     return EngToRamadan[date]!;
//   }
// }

List<Map<String, dynamic>> levelList = [
  {
    'title': 'Iron',
    'icon': Icons.emoji_objects,
    'points': 10,
  },
  {
    'title': 'Gold',
    'icon': Icons.emoji_events,
    'points': 50,
  },
  {
    'title': 'Silver',
    'icon': Icons.emoji_events,
    'points': 30,
  },
  {
    'title': 'Bronze',
    'icon': Icons.emoji_events,
    'points': 20,
  },
  {
    'title': 'Medal 1',
    'icon': Icons.star,
    'points': 15,
  },
  {
    'title': 'Medal 2',
    'icon': Icons.star,
    'points': 25,
  },
  {
    'title': 'Medal 3',
    'icon': Icons.star,
    'points': 35,
  },
  {
    'title': 'Diamond',
    'icon': Icons.diamond,
    'points': 70,
  },
  {
    'title': 'Ruby',
    'icon': Icons.whatshot,
    'points': 60,
  },
  {
    'title': 'Emerald',
    'icon': Icons.eco,
    'points': 55,
  },
  {
    'title': 'Sapphire',
    'icon': Icons.opacity,
    'points': 45,
  },
  {
    'title': 'Topaz',
    'icon': Icons.category,
    'points': 40,
  },
  {
    'title': 'Amethyst',
    'icon': Icons.healing,
    'points': 75,
  },
  {
    'title': 'Pearl',
    'icon': Icons.brightness_1,
    'points': 65,
  },
  {
    'title': 'Opal',
    'icon': Icons.remove_red_eye,
    'points': 80,
  },
  {
    'title': 'Garnet',
    'icon': Icons.ac_unit,
    'points': 85,
  },
  {
    'title': 'Aquamarine',
    'icon': Icons.waves,
    'points': 90,
  },
  {
    'title': 'Citrine',
    'icon': Icons.local_florist,
    'points': 95,
  },
  {
    'title': 'Peridot',
    'icon': Icons.nature,
    'points': 100,
  },
  {
    'title': 'Tanzanite',
    'icon': Icons.star_border,
    'points': 105,
  },
  {
    'title': 'Tourmaline',
    'icon': Icons.all_inclusive,
    'points': 110,
  },
  // Add 20 more items below
  {
    'title': 'Emeraldite',
    'icon': Icons.eco,
    'points': 115,
  },
  {
    'title': 'Jade',
    'icon': Icons.grass,
    'points': 120,
  },
  {
    'title': 'Moonstone',
    'icon': Icons.nightlight_round,
    'points': 125,
  },
  {
    'title': 'Amber',
    'icon': Icons.brightness_high,
    'points': 130,
  },
  {
    'title': 'Lapis Lazuli',
    'icon': Icons.auto_awesome,
    'points': 135,
  },
  {
    'title': 'Obsidian',
    'icon': Icons.visibility,
    'points': 140,
  },
  {
    'title': 'Coral',
    'icon': Icons.all_out,
    'points': 145,
  },
  {
    'title': 'Malachite',
    'icon': Icons.nature_people,
    'points': 150,
  },
  {
    'title': 'Onyx',
    'icon': Icons.lens,
    'points': 155,
  },
  {
    'title': 'Quartz',
    'icon': Icons.radio_button_checked,
    'points': 160,
  },
  {
    'title': 'Rose Quartz',
    'icon': Icons.favorite,
    'points': 165,
  },
  {
    'title': 'Carnelian',
    'icon': Icons.color_lens,
    'points': 170,
  },
  {
    'title': 'Agate',
    'icon': Icons.filter_vintage,
    'points': 175,
  },
  {
    'title': 'Aventurine',
    'icon': Icons.emoji_nature,
    'points': 180,
  },
  {
    'title': 'Hematite',
    'icon': Icons.grain,
    'points': 185,
  },
  {
    'title': 'Tiger Eye',
    'icon': Icons.remove,
    'points': 190,
  },
  {
    'title': 'Sardonyx',
    'icon': Icons.photo_filter,
    'points': 195,
  },
  {
    'title': 'Zircon',
    'icon': Icons.flash_on,
    'points': 200,
  },
  {
    'title': 'Iolite',
    'icon': Icons.blur_linear,
    'points': 205,
  },
  {
    'title': 'Sunstone',
    'icon': Icons.wb_sunny,
    'points': 210,
  },
];
final List<String> districtNames = [
  'Bagerhat',
  'Bandarban',
  'Barguna',
  'Barishal',
  'Bhola',
  'Bogra',
  'Brahmanbaria',
  'Chandpur',
  'Chapainawabganj',
  'Chattogram',
  'Chuadanga',
  'Cox\'s Bazar',
  'Cumilla',
  'Dhaka',
  'Dinajpur',
  'Faridpur',
  'Feni',
  'Gaibandha',
  'Gazipur',
  'Gopalganj',
  'Habiganj',
  'Jamalpur',
  'Jashore',
  'Jhalokati',
  'Jhenaidah',
  'Joypurhat',
  'Khagrachhari',
  'Khulna',
  'Kishoreganj',
  'Kurigram',
  'Kushtia',
  'Lakshmipur',
  'Lalmonirhat',
  'Madaripur',
  'Magura',
  'Manikganj',
  'Meherpur',
  'Moulvibazar',
  'Munshiganj',
  'Mymensingh',
  'Naogaon',
  'Narail',
  'Narayanganj',
  'Narsingdi',
  'Natore',
  'Nawabganj',
  'Netrakona',
  'Nilphamari',
  'Noakhali',
  'Pabna',
  'Panchagarh',
  'Patuakhali',
  'Pirojpur',
  'Rajbari',
  'Rajshahi',
  'Rangamati',
  'Rangpur',
  'Satkhira',
  'Shariatpur',
  'Sherpur',
  'Sirajganj',
  'Sunamganj',
  'Sylhet',
  'Tangail',
  'Thakurgaon',
];

List<String> koroniyo_list = [
  "আল্লাহ তা'আলার ওপর আস্থা রাখুন ",
  "সালাত সুন্দর করে ধীরস্থিরভাবে আদায় করুন ",
  "কুরআন পড়ুন। যথাসম্ভব বুঝে পড়ার চেষ্টা করুন",
  "যারা কুরআন পড়তে পারেন না, তারা সম্পূর্ণ মনোযোগের সাথে তিলাওয়াত শ্রবণ করুন",
  "প্রত্যেক ভালো কাজ আল্লাহর নামে আরম্ভ করুন",
  "আপনার সম্পদের হিসেব করে যাকাত প্রদান করুন",
  "গোপনে দান করুন",
  "নিকটাত্মীয়দের জন্য ব্যয় করুন",
  "অভাবীদের জন্য ব্যয় করুন",
  "আপনার সিয়ামকে অর্থবহ করার চেষ্টা করুন",
  " চোখের পর্দা করুন",
  "অন্যকে সৎকর্মের দিকে উৎসাহিত এবং পরিচালিত করুন",
  " দিনমজুর ও সাধারণ শ্রেণীর মানুষদের সালাম দিন",
  " অধীনস্থদের প্রতি সদয় থাকুন। তাদের কাজের বোঝা হালকা করে দিন",
  "স্বাস্থ্যসম্মত ইফতার করুন এবং অতিভোজন পরিহার করুন",
  " সাহরীতে একটি হলেও খেজুর খান",
  "ভোর রাতে আল্লাহর নিকট দু'আ করুন"
      "পথে কষ্টদায়ক কিছু দেখলে তা পরিষ্কার করুন",
  " রমাদানে তাহাজ্জুদ আদায়ের অভ্যাস করুন",
  "অর্থহীন ও অহেতুক কাজ পরিহার করুন",
  "টিভি সিরিয়াল, মুভি, নাটক ও সিনেমা দেখা পরিহার করুন"
];

List<String> borjoniyo_list = [
  "কারো ব্যাপারে সন্দেহ বা কুধারণা পোষণ করবেন না",
  "কারো পেছনে সমালোচনা করবেন না",
  "কারো প্রতি রূঢ় আচরণ করবেন না",
  "কারো প্রতি হিংসা বা শত্রুতা লালন করবেন না",
  "কারো কাছ থেকে অবৈধ কোনো সুবিধা নেবেন না বা কাউকে অবৈধ সুবিধা দেবেন না",
  "কারো মনে কষ্ট হয়, এমন কোনো আচরণ করবেন না",
  "সাহরী, ইফতার ও ঈদের কেনাকাটায় অপচয় করবেন না"
];

List<Map<String, dynamic>> Dua_Items = [
  {
    'id': 1,
    'title': 'দ্বীনের উপর অটল থাকার দোয়া',
    'bengali':
        "হে অন্তরসমূহের পরিবর্তনকারী! আমার অন্তরকে তোমার দ্বীনের উপর অটল রাখো।\nআমি জিজ্ঞাসা করলাম, “হে আল্লাহ্‌র রাসূল (ﷺ) আপনি এ দোয়াটি অধিক পরিমাণে পড়তেন। [তিরমিযীঃ ৩৫২২]",
    'arabic': "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِيْ عَلَى دِيْنِكَ",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "জান্নাত লাভ ও জাহান্নাম থেকে আশ্রয় চাওয়া",
    'bengali':
        "হে আল্লাহ্‌! আমি তোমার কাছে জান্নাত চাই; আর জাহান্নাম থেকে তোমার কাছে আশ্রয় চাই।[ইবনু মাজাহঃ ৯১০]",
    'arabic':
        "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "হিদায়াত বা পথ-নির্দেশনা-১",
    'bengali':
        "নবী (ﷺ) আলী ইবনু আবী তালিব (রাঃ)-কে আল্লাহ্‌র কাছে (এভাবে) হিদায়াত ও দৃঢ়তা চাওয়ার জন্য নির্দেশ দিয়েছেন \n[হে আল্লাহ্‌! আমি তোমার কাছে চাই হেদায়েত ও দৃঢ়তা।] [মুসলিমঃ ২৭২৫]",
    'arabic': "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ ",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "হিদায়াত বা পথ-নির্দেশনা ২",
    'bengali':
        "আমাকে সবচেয়ে সুন্দর শিষ্টাচারের দিশা দাও! তুমি ছাড়া কেউ সুন্দর শিষ্টাচারের দিশা দিতে পারে না। আমার কাছ থেকে মন্দ আচরণ দূর করে দাও! তুমি ছাড়া আর কেউ মন্দ আচরণ দূর করতে পারে না। [মুসলিমঃ ৭৭১]",
    'arabic':
        "وَاهْدِنِيْ لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِيْ لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ",
    'isChecked': false
  },
  {
    'id': 5,
    'title': "সকল কাজে উত্তম পরিণতি এবং সুরক্ষা",
    'bengali':
        "হে আল্লাহ্‌! আমাদের সকল কাজে উত্তম পরিণতি দাও, এবং দুনিয়ার অপমান এবং পরকালের শাস্তি থেকে আমাদের সুরক্ষা দাও।[জামে'উস সগীরঃ ১৪৫০]",
    'arabic':
        "اَللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآَخِرَةِ",
    'isChecked': false
  },
  {
    'id': 6,
    'title': "আল্লাহ্‌র কাছে দুনিয়া-আখিরাতের কল্যান ও প্রশান্তি চাওয়া",
    'bengali':
        "হে আল্লাহ্‌! তুমি আমার দ্বীনকে সুন্দর করো, যা আমার সকল কর্মের হিফাযতকারী। আমার পার্থিব জীবনকে সুন্দর করো, যাতে আমার জীবিকা রয়েছে। আমার পরকালকে সুন্দর করো, যাতে আমার প্রত্যাবর্তন হবে। আমার জন্য হায়াতকে প্রত্যেক কল্যাণে বৃদ্ধি করো এবং মওতকে প্রত্যেক অকল্যাণ থেকে আরামদায়ক করো।[মুসলিমঃ ২৭২০]",
    'arabic':
        "اَللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
    'isChecked': false
  },
  {
    'id': 7,
    'title': "বরকতময় মাসনূন দোয়া ১",
    'bengali':
        "(হে আল্লাহ্‌, আমি আপনার আশ্রয় নিচ্ছি কষ্টদায়ক বিপদ, গভীর দুর্ভাগ্য, খারাপ তাক্বদীর এবং শত্রুদের উপহাস থেকে।) [বুখারীঃ ৬৩৪৭]",
    'arabic':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوْءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "বরকতময় মাসনূন দোয়া ২",
    'bengali':
        "(হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি, অক্ষমতা থেকে, আলসেমি থেকে, কাপুরুষতা থেকে, কৃপণতা থেকে, অতি-বার্ধক্য থেকে এবং কবরের আযাব থেকে। হে আল্লাহ্‌, আমার নফসকে আপনি তাক্বওয়া প্রদান করুন এবং আপন তাযকিয়া-পবিত্রতা দান করুন, নফসকে পবিত্রতা তাযকিয়া প্রদানে আপনিই সর্বোত্তম, আপনিই আমার নফসের অভিভাবক ও বন্ধু। হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি এমন জ্ঞান থেকে যে জ্ঞান উপকারে লাগে না, এমন হৃদয় (ক্বলব) থেকে যে হৃদয় ভীত হয় না, এমন নফ্‌স থেকে যে নফ্‌স পরিতৃপ্ত হয় না এবং এমন দোয়া থেকে যে দোয়া কবুল হয় না।)[মুসলিমঃ ২৭২২]",
    'arabic':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، اَللَّهُمَّ آتِ نَفْسِيْ تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا.",
    'isChecked': false
  },
  {
    'id': 9,
    'title': "বরকতময় মাসনূন দোয়া ৩",
    'bengali':
        "(হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি, আপনার দেওয়া নেয়ামতের বিলুপ্তি থেকে, আপনার দেওয়া শান্তি-সুস্থতার পরিবর্তন থেকে, আপনার হঠাৎ শাস্তি থেকে এবং আপনার সর্ব প্রকারের অসন্তুষ্টি থেকে।)[মুসলিমঃ ২৭৩৯]",
    'arabic':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيْعِ سَخَطِكَ",
    'isChecked': false
  },
  {
    'id': 10,
    'title': "বরকতময় মাসনূন দোয়া ৪",
    'bengali':
        "(হে আল্লাহ্‌, আপনি আমদেরকে বাড়িয়ে দিন, কমাবেন না, আপনি আমাদেরকে সম্মানিত করুন, অপমানিত করবেন না, আমাদেরকে প্রদান করুন, বঞ্চিত করবেন না, আমাদেরকে অগ্রাধিকার প্রদান করুন, আমাদের উপর কাউকে অগ্রাধিকার দিবেন না, আপনি আমাদেরকে সন্তুষ্ট করুন এবং আমাদের উপর আপনি সন্তুষ্ট হোন।)[মুসনাদ আহমাদ ১/১২৪]",
    'arabic':
        "اَللَّهُمَّ زِدْنَا وَلَا تَنْقُصْنَا وَأَكْرِمْنَا وَلَا تُهِنَّا وَأَعْطِنَا وَلَا تَحْرِمْنَا وَآثِرْنَا وَلَا تُؤْثِرْ عَلَيْنَا وَأَرْضِنَا وَارْضَ عَنَّا ",
    'isChecked': false
  },
  {
    'id': 11,
    'title': "মহামারী ও রোগব্যাধি",
    'bengali':
        "(হে আল্লাহ্‌ আমি আপনার আশ্রয় চাচ্ছি অক্ষমতা, আলস্য, কাপুরুষতা, কৃপণতা, বার্ধক্য-জরাগ্রস্ততা, রূঢ়তা-কঠোরতা, অসতর্কতা, হীনতা-নিঃস্বতা, লাঞ্ছনা ও অসহায়ত্ব থেকে। এবং আমি আপনার আশ্রয় চাচ্ছি দারিদ্র, অবিশ্বাস, পাপাচার, বিচ্ছিন্নতা-অবাধ্যতা, মুনাফিকী, সুনামের লোভ এবং প্রদর্শনেচ্ছা থেকে। এবং আমি আপনার আশ্রয় চাচ্ছি বধিরতা, বাকশক্তিহীনতা, পাগলামি-মানসিক অসুস্থতা, কুষ্ঠ, শ্বেতী এবং সকল খারাপ রোগব্যাধি থেকে।) [সহীহুল জামিঃ ১২৮৫]",
    'arabic':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَالْقَسْوَةِ وَالْغَفْلَةِ وَالْعَيْلَةِ وَالذِّلَّةِ وَالْمَسْكَنَةِ وَأَعُوْذُ بِكَ مِنَ الْفَقْرِ وَالْكُفْرِ وَالْفُسُوْقِ وَالشِّقَّاقِ وَالنِّفَقِ وَالسُّمْعَةِ والرِّيَاءِ وَأَعُوْذُ بِكَ مِنَ الصَّمَمِ وَالْبَكَمِ وَالْجُنُوْنِ وَالْجُذَامِ وَالْبَرَصِ وَسَيِّءِ الْأَسْقَامِ ",
    'isChecked': false
  },
  {
    'id': 11,
    'title': "ক্রোধ দমনের দো‘আ",
    'bengali':
        "“আল্লাহ্‌র নিকট আশ্রয় চাই বিতাড়িত শয়তান থেকে।”বুখারী ৭/৯৯, নং ৩২৮২; মুসলিম ৪/২০১৫, নং ২৬১০।",
    'arabic': "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কেউ যদি বলে, ‘আল্লাহ আপনাকে ক্ষমা করুন’, তার জন্য দো‘আ",
    'bengali':
        "“আর আপনাকেও।”আহমাদ ৫/৮২, নং ২০৭৭৮; আন-নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, পৃ. ২১৮, নং ৪২১",
    'arabic': "وَلَكَ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কেউ আপনার সাথে সদাচারণ করলে তার জন্য দো‘আ",
    'bengali': " “আল্লাহ আপনাকে উত্তম বিনিময় দান করুন।”তিরমিযী, হাদিস নং ২০৩৫",
    'arabic': "جَزَاكَ اللَّهُ خَيْر",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কেউ ঋণ দিলে তা পরিশোধের সময় দো‘আ",
    'bengali':
        "“আল্লাহ আপনার পরিবারে ও সম্পদে বরকত দান করুন। ঋণের প্রতিদান তো কৃতজ্ঞতা প্রকাশ ও (ঠিকভাবে) আদায়।”\nআমালুল ইয়াওমি ওয়াল-লাইলাহ গ্রন্থে, পৃ. ৩০০; ইবন মাজাহ, ২/৮০৯, নং ২৪২৪।সহীহ ইবন মাজাহ, ২/৫৫।",
    'arabic':
        "بارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কাপড় পরিধানের দো‘আ",
    'bengali':
        "“সকল হামদ-প্রশংসা আল্লাহ্‌র জন্য; যিনি আমাকে এ (কাপড়)টি পরিধান করিয়েছেন এবং আমার শক্তি-সামর্থ্য ছাড়াই তিনি আমাকে এটা দান করেছেন”[আবূ দাউদ ৪০২৩] [তিরমিযী ৩৪৫৮] [ইবন মাজাহ্‌ ৩২৮৫][শাইখ আলবানী][হাসান]",
    'arabic':
        "«الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة...»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "নতুন কাপড় পরিধানের দো‘আ",
    'bengali':
        "“হে আল্লাহ্! আপনারই জন্য সকল হাম্‌দ-প্রশংসা। আপনিই এটি আমাকে পরিয়েছেন। আমি আপনার কাছে এর কল্যাণ ও এটি যে উদ্দেশ্যে তৈরি হয়েছে তার কল্যাণ প্রার্থনা করি। আর আমি এর অনিষ্ট এবং এটি যে জন্য তৈরি করা হয়েছে তার অনিষ্ট থেকে আপনার আশ্রয় চাই”|[আবূ দাউদ, নং ৪০২০; তিরমিযী, নং ১৭৬৭]",
    'arabic':
        " «اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "অপরকে নতুন কাপড় পরিধান করতে দেখলে তার জন্য দো‘আ",
    'bengali':
        "(১) “তুমি পুরাতন করে ফেলবে, আর মহান আল্লাহ এর স্থলাভিষিক্ত করবেন”[সহীহ আবি দাউদ ২/৭৬০]\n(২) “নতুন কাপড় পরিধান কর, প্রশংসিতরূপে দিনাতিপাত কর এবং শহীদ হয়ে মারা যাও”[সুনান ইবন মাজাহ ২/১১৭৮, নং ৩৫৫৮; বাগাওয়ী, ১২/৪১]",
    'arabic':
        "(1) «تُبْلِي وَيُخْلِفُ اللَّهُ تَعَالَى»\n(2) «اِلْبَسْ جَدِيداً وَعِشْ حَمِيداً وَمُتْ شَهِيداً»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কাপড় খুলে রাখার সময় কী বলবে",
    'bengali': "“আল্লাহ্‌র নামে (খুলে রাখলাম)”তিরমিযী ২/৫০৫]",
    'arabic': "«بِسْمِ اللَّهِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "পায়খানায় প্রবেশের দো‘আ",
    'bengali':
        "“[আল্লাহ্‌র নামে।] হে আল্লাহ! আমি আপনার নিকট অপবিত্র নর জিন্ ও নারী জিন্ থেকে আশ্রয় চাই”[বুখারী ১/৪৫, নং ১৪২; মুসলিম ১/২৮৩, নং ৩৭৫। শুরুতে অতিরিক্ত ‘বিসমিল্লাহ্‌’ উদ্ধৃত করেছেন সা‘ঈদ ইবন মানসূর।[ফাতহুল বারী, ১/২৪৪]",
    'arabic':
        "«[بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বাথরুম থেকে বের হওয়ার দোয়া",
    'bengali':
        "সব প্রশংসা আল্লাহর জন্য, যিনি আমার কাছ থেকে কষ্টদায়ক বস্তু বের করে দিয়েছেন এবং আমাকে নিরাপদ করেছেন। (ইবনে মাজাহ: ২৯৭)\n“2) আমি আপনার কাছে ক্ষমাপ্রার্থী।”[আবূ দাউদ ৩০; তিরমিযী ৭; ইবন মাজাহ্‌ ৩০০]",
    'arabic':
        "\n «غُفْرَانَكَ» الْحَمْدُ لِلهِ الَّذِيْ اَذْهَبَ عَنِّيْ الْاَذَى وَعَافَانِيْ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বাড়ি থেকে বের হওয়ার সময়ের যিক্‌র",
    'bengali':
        "(১) “আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহর উপর ভরসা করলাম। আর আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই”[আবূ দাউদ ৪/৩২৫, নং ৫০৯৫; তিরমিযী ৫/৪৯০, ৩৪২৬]\n(২) “হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই যেন নিজেকে বা অন্যকে পথভ্রষ্ট না করি, অথবা অন্যের দ্বারা পথভ্রষ্ট না হই; আমার নিজের বা অন্যের পদস্খলন না করি, অথবা আমায় যেন পদস্খলন করানো না হয়; আমি যেন নিজের বা অন্যের উপর যুলম না করি অথবা আমার প্রতি যুলম না করা হয়; আমি যেন নিজে মুর্খতা না করি, অথবা আমার উপর মূর্খতা করা না হয়।”[আবূ দাউদ ৫০৯৪; তিরমিযী ৩৪২৭; নাসাঈ ৫৫০১; ইবন মাজাহ ৩৮৮৪]",
    'arabic':
        "(1) «بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ»\n(2) «اللّٰـهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বায়ূ প্রবাহিত হলে পড়ার দো‘আ",
    'bengali':
        "(১) “হে আল্লাহ! আমি আপনার নিকট এর কল্যাণ চাই। আর আমি আপনার নিকট এর অনিষ্ট থেকে আশ্রয় চাই।”[আবূ দাউদ ৪/৩২৬, নং ৫০৯৯; ইবন মাজাহ্‌ ২/১২২৮, নং ৩৭২৭]\n(২) “হে আল্লাহ! আমি আপনার নিকট প্রার্থনা করি এর কল্যাণ, এর মধ্যকার কল্যাণ এবং যা এর সাথে প্রেরিত হয়েছে তার কল্যাণ। আর আমি আপনার আশ্রয় চাই এর অনিষ্ট থেকে, এর ভেতরে নিহিত অনিষ্ট থেকে এবং যা এর সাথে প্রেরিত হয়েছে তার অনিষ্ট থেকে।”[বুখারী, ৪/৭৬, নং ৩২০৬ ও ৪৮২৯]",
    'arabic':
        "(1) «اللَّهُمَّ إِنِّي أَسْــــــأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا»\n(2) «اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "মেঘের গর্জন শুনলে পড়ার দো‘আ",
    'bengali':
        "“পবিত্র-মহান সেই সত্তা, রা‘দ ফেরেশ্তা যাঁর মহিমা ও পবিত্রতা ঘোষণা করে প্রশংসার সাথে, আর ফেরেশ্তাগণও তা-ই করে যাঁর ভয়ে।”[মুওয়াত্তা ইমাম মালেক ২/৯৯২]",
    'arabic':
        "«سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বৃষ্টি চাওয়ার কিছু দো‘আ",
    'bengali':
        "(১) “হে আল্লাহ! আমাদেরকে এমন বৃষ্টির পানি দান করুন যা সাহায্যকারী, সুপেয়, উর্বরকারী; কল্যাণকর, ক্ষতিকর নয়; শীঘ্রই, বিলম্বে নয়।”[আবূ দাউদ, ১/৩০৩,নং ১১৭১]\n(২) “হে আল্লাহ! আমাদেরকে বৃষ্টি দিন। হে আল্লাহ! আমাদেরকে বৃষ্টি দিন। হে আল্লাহ! আমাদেরকে বৃষ্টি দিন।”[বুখারী ১/২২৪,নং ১০১৪;মুসলিম ২/৬১৩,নং ৮৯৭]\n(৩) “হে আল্লাহ! আপনি আপনার বান্দাগণকে ও জীব- জন্তুগুলোকে পানি পান করান, আর আপনার রহমত বিস্তৃত করুন এবং আপনার মৃত শহরকে সজীব করুন।”[আবূ দাউদ ১/৩০৫,নং ১১৭৮]",
    'arabic':
        "(1) «اللَّهُمَّ اسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ»\n(2) «اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا»\n(3) «اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِي بَلَدَكَ الْمَيِّتَ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বৃষ্টি দেখলে দো‘আ",
    'bengali':
        "“হে আল্লাহ! মুষলধারায় উপকারী বৃষ্টি বর্ষণ করুন।”[বুখারী ২/৫১৮, নং ১০৩২]",
    'arabic': " اللَّهُمَّ صَيِّباً نَافِعاً.",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বৃষ্টি বর্ষণের পর যিকর",
    'bengali':
        "“আল্লাহ্‌র অনুগ্রহ ও দয়ায় আমাদের উপর বৃষ্টি বর্ষিত হয়েছে।”[বুখারী ১/২০৫,নং ৮৪৬; মুসলিম ১/৮৩,নং ৭১]",
    'arabic': " مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "অতিবৃষ্টি বন্ধের জন্য কিছু দো‘আ",
    'bengali':
        "“হে আল্লাহ! আমাদের পার্শ্ববর্তী এলাকায় (বর্ষণ করুন), আমাদের উপর নয়। হে আল্লাহ! উঁচু ভূমিতে, পাহাড়ে, উপত্যকার কোলে ও বনাঞ্চলে (বর্ষণ করুন)।”[বুখারী ১/২২৪,নং ৯৩৩; মুসলিম ২/৬১৪,নং ৮৯৭]",
    'arabic':
        "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الْأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ.",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "খাওয়ার পূর্বে দো‘আ",
    'bengali':
        "“হে আল্লাহ! আপনি আমাদেরকে এই খাদ্যে বরকত দিন এবং এর চেয়েও উত্তম খাদ্য আহার করান।”[তিরমিযী ৫/৫০৬,নং ৩৪৫৫]",
    'arabic': "« اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "আহার শেষ করার পর দো‘আ",
    'bengali':
        "(১) “সকল প্রশংসা আল্লাহ্‌র জন্য, যিনি আমাকে এ আহার করালেন এবং এ রিযিক দিলেন যাতে ছিল না আমার পক্ষ থেকে কোনো উপায়, ছিল না কোনো শক্তি-সামর্থ্য।”[আবূ দাউদ ৪০২৫; তিরমিযী ৩৪৫৮; ইবন মাজাহ ৩২৮৫]\n(২) “আল্লাহর জন্যই সকল প্রশংসা; এমন প্রশংসা যা অঢেল, পবিত্র ও যাতে রয়েছে বরকত; [যা যথেষ্ট করা হয় নি], যা বিদায় দিতে পারব না, আর যা থেকে বিমুখ হতে পারব না, হে আমাদের রব্ব!”[বুখারী ৬/২১৪,হাদীস নং ৫৪৫৮]",
    'arabic':
        "(1) «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ»\n(2) «الْحَمْدُ لِلَّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، غَيْرَ [مَكْفِيٍّ وَلاَ ] مُوَدَّعٍ، وَلاَ مُسْتَغْنَىً عَنْهُ رَبَّنَا»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "আহারের আয়োজনকারীর জন্য মেহমানের দো‘আ",
    'bengali':
        "“হে আল্লাহ! আপনি তাদেরকে যে রিযিক দান করেছেন তাতে তাদের জন্য বরকত দিন এবং তাদের গুনাহ মাফ করুন, আর তাদের প্রতি দয়া করুন।”[মুসলিম ৩/১৬১৫,নং ২০৪২]",
    'arabic':
        "«اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُم، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "দো‘আর মাধ্যমে খাবার বা পানীয় চাওয়ার ইঙ্গিত করা",
    'bengali':
        "“হে আল্লাহ! যে আমাকে আহার করাবে আপনি তাদেরকে আহার করান এবং যে আমাকে পান করাবে আপনি তাদেরকে পান করান।”[মুসলিম ৩/১৬২৬,নং ২০৫৫]",
    'arabic': " «اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কোনো পরিবারের কাছে ইফতার করলে তাদের জন্য দো‘আ",
    'bengali':
        "“আপনাদের কাছে রোযাদাররা ইফতার করুন, আপনাদের খাবার যেন সৎলোকেরা খায়, আর আপনাদের জন্য ফিরিশতারা ক্ষমা প্রার্থনা করুন।”[সুনান আবি দাউদ ৩/৩৬৭,নং ৩৮৫৬; ইবন মাজাহ ১/৫৫৬,নং ১৭৪৭]",
    'arabic':
        " «أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "ফলের কলি দেখলে পড়ার দো‘আ",
    'bengali':
        "“হে আল্লাহ, আপনি আমাদের ফল-ফলাদিতে বরকত দিন, আমাদের শহরে বরকত দিন, আমাদের সা‘ তথা বড় পরিমাপক যন্ত্রে বরকত দিন, আমাদের মুদ্দ তথা ছোট পরিমাপক যন্ত্রে বরকত দিন।”[মুসলিম, ২/১০০০,নং ১৩৭৩]",
    'arabic':
        "«اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "হাঁচির দো‘আ",
    'bengali':
        " তোমাদের কেউ হাঁচি দিলে বলবে[1]\nতার মুসলিম ভাই বা সাথী যেন অবশ্যই বলে[2]\nযখন তাকে ইয়ারহামুকাল্লাহ বলা হয়, তখন হাঁচিদাতা যেন তার উত্তরে বলে[3]",
    'arabic':
        "[1]«الْحَمْدُ لِلَّهِ»\n [2] « يَرْحَمُكَ اللَّهُ »\n[3]« يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বিপন্ন লোক দেখলে পড়ার দো‘আ",
    'bengali':
        " “সকল প্রশংসা আল্লাহ্‌র জন্য, যিনি আপনাকে যে পরীক্ষায় ফেলেছেন তা থেকে আমাকে নিরাপদ রেখেছেন এবং তার সৃষ্টির অনেকের উপরে আমাকে অধিক সম্মানিত করেছেন।”[তিরমিযী ৫/৪৯৪,৫/৪৯৩,নং ৩৪৩২]",
    'arabic':
        "«الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً»",
    'isChecked': false
  },
  {
    'id': 13,
    'title':
        "যে ব্যক্তি বলবে, ‘আমি আপনাকে আল্লাহ্‌র জন্য ভালোবাসি’— তার জন্য দো‘আ",
    'bengali':
        "“যাঁর জন্য আপনি আমাকে ভালোবেসেছেন, তিনি আপনাকে ভালোবাসুন।”[আবু দাঊদ ৪/৩৩৩, নং ৫১২৫]",
    'arabic': " «أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কেউ যদি বলে, ‘আল্লাহ আপনার উপর বরকত দিন’, তার জন্য দো‘আ",
    'bengali':
        "“আর আপনার মধ্যেও আল্লাহ বরকত দিন।”[ইবনুল কাইয়্যেমের আল-ওয়াবিলুস সাইয়্যেব, পৃ. ৩০৪]",
    'arabic': "«وَفِيكَ بَارَكَ اللَّهُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "যাকে আপনি গালি দিয়েছেন তার জন্য দো‘আ",
    'bengali':
        "“হে আল্লাহ! যে মুমিনকেই আমি গালি দিয়েছি, তা তার জন্য কিয়ামতের দিন আপনার নৈকট্যের মাধ্যম করে দিন।”[বুখারী (ফাতহুল বারীসহ) ১১/১৭১, নং ৬৩৬১; মুসলিম ৪/২০০৭, নং ৩৯৬]",
    'arabic':
        "«اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কোনো মুসলিম অপর মুসলিমকে প্রশংসা করলে যা বলবে",
    'bengali':
        "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “যখন তোমাদের মধ্যে কেউ কারো প্রশংসা করতেই হয়, তখন যেন সে বলে:\n“অমুক প্রসঙ্গে আমি এ ধারণা রাখি, আর আল্লাহই তার ব্যাপারে সঠিক হিসাবকারী, আল্লাহ্‌র উপর (তাঁর জ্ঞানের উপরে উঠে) কারও প্রশংসা করছি না। আমি মনে করি, সে এ ধরনের, ও ধরনের -যদি তার সম্পর্কে তা জানা থাকে-।”[মুসলিম, ৪/২২৯৬,নং ৩০০০]",
    'arabic':
        "« أَحْسِبُ فُلاَناً وَاللَّهُ حَسِيبُهُ، وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَداً، أَحْسِبُهُ – إِنْ كَانَ يَعْلَمُ ذَاكَ – كَذَا وَكَذَا»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "আনন্দদায়ক কোনো সংবাদ আসলে যা করবে",
    'bengali':
        "“নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট কোনো আনন্দদায়ক সংবাদ এলে মহান ও বরকতময় আল্লাহ তা‘আলার শুকরিয়া আদায়স্বরূপ সিজদায় পড়ে যেতেন।”[আবূ দাউদ নং ২৭৭৪; তিরমিযী নং ১৫৭৮; ইবন মাজাহ্‌ ১৩৯৪]",
    'arabic': "",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "রাতে যখন পার্শ্ব পরিবর্তন করে তখন পড়ার দো‘আ",
    'bengali':
        "“মহাপ্রতাপশালী এক আল্লাহ ছাড়া আর কোনো হক্ব ইলাহ নেই। (তিনি) আসমানসমূহ, যমীন এবং এ দু’য়ের মধ্যস্থিত সবকিছুর রব্ব, প্রবলপরাক্রমশালী, পরম ক্ষমাশীল।”[হাকেম ১/৫৪০; নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলা নং ২০২;ইবনুস সুন্নী,নং ৭৫৭]",
    'arabic':
        "«لاَ إِلَهَ إِلاَّ اللَّهُ الْوَاحِدُ الْقَهّارُ، رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزيزُ الْغَفَّارُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "ঘুম থেকে জেগে উঠার সময়ের যিক্‌রসমূহ",
    'bengali':
        " “হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি (নিদ্রারূপ) মৃত্যুর পর আমাদেরকে জীবিত করলেন, আর তাঁরই নিকট সকলের পুনরুত্থান”[বুখারী ফাতহুল বারী ১১/১১৩, নং ৬৩১৪; মুসলিম ৪/২০৮৩, নং ২৭১১]\n(২) “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, প্রশংসাও তাঁরই; আর তিনি সকল কিছুর ওপর ক্ষমতাবান। আল্লাহ পবিত্র-মহান। সকল হামদ-প্রশংসা আল্লাহ্‌র। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই। আল্লাহ সবচেয়ে বড়। সুউচ্চ সুমহান আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই। হে রব্ব ! আমাকে ক্ষমা করুন”।[বুখারী: ফাতহুল বারী, ৩/৩৯, নং ১১৫৪]",
    'arabic':
        "(1) «الْحَمْدُ لِلَّهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُوْرُ»\n(2) «لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ» «رَبِّ اغْفرْ لِي»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "খারাপ স্বপ্ন বা দুঃস্বপ্ন দেখে যা করবে",
    'bengali':
        "(১) “তার বাম দিকে হাল্কা থুথু ফেলবে।” (৩ বার)[মুসলিম, ৪/১৭৭২, নং ২২৬১]\n(২) “শয়তান থেকে এবং যা দেখেছে তার অনিষ্ট থেকে আল্লাহর কাছে আশ্রয় চাইবে প্রার্থনা করবে।” (৩ বার)[মুসলিম, ৪/১৭৭২, ১৭৭৩, নং ২২৬১, ২২৬২]\n(৩) “কাউকে এ ব্যাপারে কিছু বলবে না।”[মুসলিম, ৪/১৭৭২, নং ২২৬১ ও নং ২২৬৩]\n(৪) “অতঃপর যে পার্শ্বে সে ঘুমিয়েছিল তা পরিবর্তন করবে।”[মুসলিম, ৪/১৭৭৩, নং ২২৬১]\n(৫) “যদি ইচ্ছা করে তবে উঠে সালাত আদায় করবে।” [মুসলিম ৪/১৭৭৩, নং ২২৬৩]",
    'arabic': "",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "রাতের বেলায় কুকুরের ডাক শুনলে দো‘আ",
    'bengali':
        "“যখন তোমরা রাত্রিবেলা কুকুরের ডাক ও গাধার স্বর শুনবে, তখন তোমরা সেগুলো থেকে আল্লাহ্‌র কাছে আশ্রয় চাও; কেননা সেগুলো তা দেখে তোমরা যা দেখতে পাও না।”[আবূ দাঊদ ৪/৩২৭, নং ৫১০৫; আহমাদ ৩/৩০৬, নং ১৪২৮৩]",
    'arabic': "",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "মসজিদে প্রবেশের দো‘আ",
    'bengali':
        "“আমি মহান আল্লাহ্‌র কাছে তাঁর সম্মানিত চেহারা ও প্রাচীন ক্ষমতার ওসীলায় বিতাড়িত শয়তান থেকে আশ্রয় প্রার্থনা করছি।”[আবূ দাউদ ৪৬৬]\n[আল্লাহ্‌র নামে (প্রবেশ করছি), সালাত][আস-সামারুল মুস্তাতাব গ্রন্থে একে হাসান বলেছেন, পৃ. ৬০৭]\n [ও সালাম আল্লাহ্‌র রাসূলের উপর।][আবূ দাউদ ১/১২৬;নং ৪৬৫]\n“হে আল্লাহ! আপনি আমার জন্য আপনার রহমতের দরজাসমূহ খুলে দিন।”[মুসলিম ১/৪৯৪,নং ৭১৩]",
    'arabic':
        "«أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ» [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ] «اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "মসজিদ থেকে বের হওয়ার দো‘আ",
    'bengali':
        "“আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহ্‌র রাসুলের উপর শান্তি বর্ষিত হোক। হে আল্লাহ! আপনি আমার গুনাসমূহ মাফ করে দিন এবং আমার জন্য আপনার দয়ার দরজাগুলো খুলে দিন। হে আল্লাহ, আমাকে বিতাড়িত শয়তান থেকে হেফাযত করুন”[ইবন মাজাহ্‌ ১/১২৯]",
    'arabic':
        "«بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "দুই সিজদার মধ্যবর্তী বৈঠকের দো‘আ",
    'bengali':
        "“হে আল্লাহ! আপনি আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথে পরিচালিত করুন, আমার সমস্ত ক্ষয়ক্ষতি পূরণ করে দিন, আমাকে নিরাপত্তা দান করুন, আমাকে রিযিক দান করুন এবং আমার মর্যাদা বৃদ্ধি করুন”[আবূ দাউদ ১/২৩১,নং ৮৫০;তিরমিযী,নং ২৮৪,২৮৫;ইবন মাজাহ,নং ৮৯৮]",
    'arabic':
        "«اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "নতুন চাঁদ দেখে পড়ার দো‘আ",
    'bengali':
        "“আল্লাহ সবচেয়ে বড়। হে আল্লাহ! এই নতুন চাঁদকে আমাদের উপর উদিত করুন নিরাপত্তা, ঈমান, শান্তি ও ইসলামের সাথে; আর হে আমাদের রব্ব! যা আপনি পছন্দ করেন এবং যাতে আপনি সন্তুষ্ট হন তার প্রতি তাওফীক লাভের সাথে। আল্লাহ আমাদের রব্ব এবং তোমার (চাঁদের) রব্ব।”[তিরমিযী ৫/৫০৪,নং ৩৪৫১;আদ-দারিমী,১/৩৩৬]",
    'arabic':
        " اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالْإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّ",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "দুঃখ ও দুশ্চিন্তার সময় পড়ার দো‘আ",
    'bengali':
        "(১)“হে আল্লাহ! আমি আপনার বান্দা, আপনারই এক বান্দার পুত্র এবং আপনার এক বাঁদীর পুত্র। আমার কপাল (নিয়ন্ত্রণ) আপনার হাতে; আমার উপর আপনার নির্দেশ কার্যকর; আমার ব্যাপারে আপনার ফয়সালা ন্যায়পূর্ণ। আমি আপনার কাছে প্রার্থনা করি আপনার প্রতিটি নামের উসীলায়; যে নাম আপনি নিজের জন্য নিজে রেখেছেন অথবা আপনার আপনি আপনার কিতাবে নাযিল করেছেন অথবা আপনার সৃষ্টজীবের কাউকেও শিখিয়েছেন অথবা নিজ গায়েবী জ্ঞানে নিজের জন্য সংরক্ষণ করে রেখেছেন—আপনি কুরআনকে বানিয়ে দিন আমার হৃদয়ের প্রশান্তি, আমার বক্ষের জ্যোতি, আমার দুঃখের অপসারণকারী এবং দুশ্চিন্তা দূরকারী।”[আহমাদ ১/৩৯১, নং ৩৭১২]\n(২) “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।”[বুখারী,৭/১৫৮,নং ২৮৯৩]",
    'arabic':
        "(1) «اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُــــلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي»\n(2) «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "দুর্দশাগ্রস্ত ব্যক্তির দো‘আ",
    'bengali':
        "(১) “আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান ও সহিষ্ণু। ‘আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান আরশের রব্ব। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি আসমানসমূহের রব্ব, যমীনের রব্ব এবং সম্মানিত আরশের রব্ব।”[বুখারী, (ফাতহুল বারীসহ) ৭/১৫৪, নং ৬৩৪৫; মুসলিম ৪/২০৯২, নং ২৭৩০]\n(২) “হে আল্লাহ! আমি আপনার রহমতেরই আশা করি। তাই আপনি এক নিমেষের জন্যও আমাকে আমার নিজের কাছে সোপর্দ করবেন না। আপনি আমার সার্বিক বিষয়াদি সংশোধন করে দিন। আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”[আবূ দাউদ, ৪/৩২৪, নং ৫০৯০; আহমাদ ৫/৪২, নং ২০৪৩০]\n(৩) “আপনি ছাড়া কোনো হক্ব ইলাহ নেই, আপনি পবিত্র-মহান, নিশ্চয় আমি যালেমদের অন্তর্ভুক্ত।”[তিরমিযী ৫/৫২৯, নং ৩৫০৫]",
    'arabic':
        "(1) «لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ»\n(2) «اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ»\n(3) «لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظّالِمِينَ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "ঋণ মুক্তির জন্য দো‘আ",
    'bengali':
        "(১) “হে আল্লাহ! আপনি আমাকে আপনার হালাল দ্বারা পরিতুষ্ট করে আপনার হারাম থেকে ফিরিয়ে রাখুন এবং আপনার অনুগ্রহ দ্বারা আপনি ছাড়া অন্য সকলের থেকে আমাকে অমুখাপেক্ষী করে দিন।”[তিরমিযী ৫/৫৬০, নং ৩৫৬৩]\n(২) “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।”[বুখারী, ৭/১৫৮, নং ২৮৯৩]",
    'arabic':
        "(1) «اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ»\n(2) «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "রোগী দেখতে গিয়ে তার জন্য দো‘আ",
    'bengali':
        "(১) “কোনো ক্ষতি নেই, আল্লাহ যদি চান তো (রোগটি গুনাহ থেকে) পবিত্রকারী হবে।”[বুখারী (ফাতহুল বারীসহ) ১০/১১৮,নং ৩৬১৬]\n(২) “আমি মহান আল্লাহ্‌র কাছে চাচ্ছি, যিনি মহান আরশের রব, তিনি যেন আপনাকে রোগমুক্তি প্রদান করেন।”[তিরমিযী,নং ২০৮৩; আবূ দাউদ,নং ৩১০৬]",
    'arabic':
        "(1) «لاَ بأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ»\n(2) «أَسْأَلُ اللَّهَ الْعَظيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفيَكَ» (সাতবার)",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "কোনো মুসিবতে পতিত ব্যক্তির দো‘আ",
    'bengali':
        "“আমরা তো আল্লাহ্‌রই। আর নিশ্চয় আমরা তাঁর দিকেই প্রত্যাবর্তনকারী। হে আল্লাহ! আমাকে আমার বিপদে সওয়াব দিন এবং আমার জন্য তার চেয়েও উত্তম কিছু স্থলাভিষিক্ত করে দিন।”[মুসলিম ২/৬৩২,নং ৯১৮]",
    'arabic':
        " «إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرَاً مِنْهَا»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "শরীরে কোনো ব্যথা অনুভব করলে যা করবে ও বলবে",
    'bengali':
        "“আপনার দেহের যে স্থানে আপনি ব্যথা অনুভব করছেন, সেখানে আপনার হাত রেখে তিনবার বলুন,(বিসমিল্লাহ) ,আর সাতবার বলুন:“এই যে ব্যথা আমি অনুভব করছি এবং যার আমি আশঙ্কা করছি, তা থেকে আমি আল্লাহ্‌র এবং তাঁর কুদরতের আশ্রয় প্রার্থনা করছি।”[মুসলিম ৪/১৭২৮, নং ২২০২]",
    'arabic':
        "«بِسْمِ اللَّهِ»\n«أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "স্ত্রী-সহবাসের পুর্বের দো‘আ",
    'bengali':
        "“আল্লাহ্‌র নামে। হে আল্লাহ! আপনি আমাদের থেকে শয়তানকে দূরে রাখুন এবং আমাদেরকে আপনি যে সন্তান দান করবেন তার থেকেও শয়তানকে দূরে রাখুন।”[বুখারী ৬/১৪১, নং ১৪১; মুসলিম ২/১০২৮, নং ১৪৩৪]",
    'arabic':
        "«بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "নব বিবাহিতের জন্য দো‘আ",
    'bengali':
        "“আল্লাহ আপনার জন্য বরকতদান করুন, আপনার উপর বরকত নাযিল করুন এবং কল্যাণের সাথে আপনাদের উভয়কে একত্রিত করুন।”[আবু দাঊদ,নং ২১৩০;তিরমিযী,নং ১০৯১;ইবন মাজাহ,নং ১৯০৫]",
    'arabic':
        "«بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "পাপ করে ফেললে যা বলবে এবং যা করবে",
    'bengali':
        "“যদি কোনো বান্দা কোনো পাপ কাজ করে ফেলে, অতঃপর সে উত্তমরূপে পবিত্রতা অর্জন করে এবং দাঁড়িয়ে যায় ও দু রাক‘আত সালাত আদায় করে, তারপর আল্লাহ্‌র কাছে ক্ষমা প্রার্থনা করে, তাহলে আল্লাহ তাকে ক্ষমা করে দেবেন।”[আবূ দাউদ ২/৮৬, ১৫২১;তিরমিযী ২/২৫৭,নং ৪০৬]",
    'arabic': "",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বাজারে প্রবেশের দো‘আ",
    'bengali':
        "“একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরিক নেই, রাজত্ব তাঁরই, প্রশংসা মাত্রই তাঁর। তিনিই জীবন দান করেন এবং তিনিই মারেন। আর তিনি চিরঞ্জীব, মারা যাবেন না। সকল প্রকার কল্যাণ তাঁর হাতে নিহিত। তিনি সব কিছুর উপর ক্ষমতাবান।”[তিরমিযী, নং ৩৪২৮; ইবন মাজাহ, ৫/২৯১, নং ৩৮৬০; হাকেম ১/৫৩৮]",
    'arabic':
        " «لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لاِ يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ»",
    'isChecked': false
  },
  {
    'id': 13,
    'title': "বাহনে আরোহণের দো‘আ",
    'bengali':
        "“আল্লাহ্‌র নামে; আর সকল প্রশংসা আল্লাহ্‌র জন্য। পবিত্র মহান সেই সত্তা, যিনি একে আমাদের জন্য বশীভূত করে দিয়েছেন, অন্যথায় আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই প্রত্যাবর্তন করবো আমাদের রব্বের দিকে। সকল প্রশংসা আল্লাহ্‌র জন্য, সকল প্রশংসা আল্লাহ্‌র জন্য, সকল প্রশংসা আল্লাহ্‌র জন্য। আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়। হে আল্লাহ! আপনি পবিত্র-মহান; আমি আমার নিজের উপর যুলুম করেছি, সুতরাং আপনি আমাকে মাফ করে দিন। কেননা, আপনি ছাড়া গুনাহ মাফ করার আর কেউ নেই।”[আবু দাঊদ ৩/৩৪,২৬০২;তিরমিযী ৫/৫০১,নং ৩৪৪৬]",
    'arabic':
        "«بِسْمِ اللَّهِ، وَالْحَمْدُ للَّهِ ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾، «الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ»",
    'isChecked': false
  },
  // {'id': 13, 'title': "", 'bengali': "", 'arabic': "", 'isChecked': false},
  // {'id': 13, 'title': "", 'bengali': "", 'arabic': "", 'isChecked': false},
  // {'id': 13, 'title': "", 'bengali': "", 'arabic': "", 'isChecked': false},
  // {'id': 13, 'title': "", 'bengali': "", 'arabic': "", 'isChecked': false},
  // {'id': 13, 'title': "", 'bengali': "", 'arabic': "", 'isChecked': false},
];

TextEditingController quran_ayat_hifz_controller = new TextEditingController();
TextEditingController natun_maswala_sikha_controller =
    new TextEditingController();
TextEditingController islamic_natun_kisu_sikha_controller =
    new TextEditingController();
TextEditingController quran_tilwat_kora_controller =
    new TextEditingController();
TextEditingController quran_tafsir_pora_controller =
    new TextEditingController();
TextEditingController dua_mukhusto_kora_controller =
    new TextEditingController();
List<Map<String, dynamic>> Good_Afternoon_Items_inputs = [
  {
    'id': 1,
    'title': "ক্বুর'আনের আয়াত হিফজ",
    'Value': "২০ আয়াত বা সুরা মুলক ১-২০",
    'controller': quran_ayat_hifz_controller,
    'isChecked': false
  },
  {
    'id': 2,
    'title': "নতুন মাস'আলা শেখা",
    'Value': "২ টা মাস'আলা",
    'controller': natun_maswala_sikha_controller,
    'isChecked': false
  },
  {
    'id': 3,
    'title': "ইসলামিক নতুন কিছু শেখা",
    'Value': "২টা হাদিস + ২ টা ইসলামিক আদব/মাস'আলা",
    'controller': islamic_natun_kisu_sikha_controller,
    'isChecked': false
  },
  {
    'id': 4,
    'title': "ক্বুর'আন তিলাওয়াত করা",
    'Value': "৫০ মিনিট বা ১০০ আয়াত",
    'controller': quran_tilwat_kora_controller,
    'isChecked': false
  },
  {
    'id': 5,
    'title': "ক্বুর'আনের তাফসীর অধ্যয়ন",
    'Value': "৩০ মিনিট",
    'controller': quran_tafsir_pora_controller,
    'isChecked': false
  },
  {
    'id': 6,
    'title': "দু'আ মুখস্ত করা",
    'controller': dua_mukhusto_kora_controller,
    'Value': "৩০ মিনিট অথবা ২ টা দু'আ",
    'isChecked': false
  },
];
List<List<String>> Asmaul_Husna = [
  ["ٱلْرَّحْمَـانُ", "পরম দয়ালু"],
  ["ٱلْرَّحِيْمُ", "অতিশয় মেহেরবান"],
  ["ٱلْمَلِكُ", "সর্বকর্তৃত্বময়"],
  ["ٱلْقُدُّوسُ", "অতি পবিত্র"],
  ["ٱلْسَّلَامُ", "শান্তি দানকারী"],
  ["ٱلْمُؤْمِنُ", "নিরাপত্তা ও ঈমান দানকারী"],
  ["ٱلْمُهَيْمِنُ", "পরিপূর্ণ রক্ষণাবেক্ষণকারী"],
  ["ٱلْعَزِيزُ", "পরাক্রমশালী"],
  ["ٱلْجَبَّارُ", "দুর্নিবার"],
  ["ٱلْمُتَكَبِّرُ", "নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী"],
  ["ٱلْخَالِقُ", "সৃষ্টিকর্তা"],
  ["ٱلْبَارِئُ", "সঠিকভাবে সৃষ্টিকারী"],
  ["ٱلْمُصَوِّرُ", "আকৃতি দানকারী"],
  ["ٱلْغَفَّارُ", "পরম ক্ষমাশীল"],
  ["ٱلْقَهَّارُ", "কঠোর"],
  ["لْوَهَّابُ", " সবকিছু দানকারী"],
  ["لْرَّزَّاقُ", "রিযিকদাতা"],
  ["ٱلْفَتَّاحُ", "বিজয়দানকারী"],
  ["ٱلْعَلِيمُ", "সর্বজ্ঞ"],
  ["ٱلْقَابِضُ", "সংকীর্ণকারী"],
  ["ٱلْبَاسِطُ", "প্রশস্তকারী"],
  ["ٱلْخَافِضُ", "অবনতকারী"],
  ["ٱلْرَّافِعُ", "উন্নতকারী"],
  ["ٱلْمُعِزُّ", "সম্মান দানকারী"],
  [" ٱلْمُذِلُّ", "(অবিশ্বাসীদের) বেইজ্জতকারী"],
  ["ٱلْسَّمِيعُ", "সর্বশ্রোতা"],
  ["ٱلْبَصِيرُ", "সর্ববিষয় দর্শনকারী"],
  ["ٱلْحَكَمُ", "অতল বিচারক"],
  ["ٱلْعَدْلُ", "পরিপূর্ণ ন্যায়বিচারক"],
  ["ٱلْلَّطِيفُ", "সকল গোপন বিষয়ে অবগত"],
  ["ٱلْخَبِيرُ", "সকল বিষয়ে জ্ঞাত"],
  ["ٱلْحَلِيمُ", "অত্যন্ত ধর্য্যশীল"],
  ["ٱلْعَظِيمُ", "সর্বত্ত মর্যাদাশীল"],
  ["ٱلْغَفُورُ", "পরম ক্ষমাশীল"],
  ["ٱلْشَّكُورُ", "গুন্গ্রাহী"],
  ["ٱلْعَلِيُّ", "উচ্চ মর্যাদাশীল"],
  ["ٱلْكَبِيرُ", "সুমহান"],
  ["ٱلْحَفِيظُ", "সংরক্ষণকারী"],
  ["ٱلْمُقِيتُ", "সকলের জীবনোপকরণ দানকারী"],
  ["ٱلْحَسِيبُ", "হিসাব গ্রহণকারী"],
  ["ٱلْجَلِيلُ ", "আল জলীল- পরম মর্যাদার অধিকারী"],
  ["ٱلْكَرِيمُ", "সুমহান দাতা"],
  ["ٱلْرَّقِيبُ", "তত্ত্বাবধায়ক"],
  ["ٱلْمُجِيبُ", "কবুলকারী"],
  ["ٱلْوَاسِعُ", "সর্বত্ত বিরাজমান"],
  ["ٱلْحَكِيمُ", "পরম প্রজ্ঞাময়"],
  ["ٱلْوَدُودُ", "(বান্দাদের প্রতি) সদয়"],
  ["ٱلْمَجِيدُ", "সকল মর্যাদার অধিকারী"],
  ["ٱلْبَاعِثُ", "পুনরুজ্জীবিতকারী"],
  ["ٱلْشَّهِيدُ", "সর্বজ্ঞ স্বাক্ষী"],
  ["ٱلْحَقُّ", "পরম সত্য"],
  ["ٱلْوَكِيلُ", "পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী"],
  ["ٱلْقَوِيُّ", "পরম শক্তির অধিকারী"],
  ["ٱلْمَتِينُ", "সুদৃঢ়"],
  ["ٱلْوَلِيُّ", "অভিভাবক ও সাহায্যকারী"],
  ["ٱلْحَمِيدُ", "সকল প্রশংসার অধিকারী"],
  ["ٱلْمُحْصِيُ", "সকল সৃষ্টির ব্যাপারে অবগত"],
  ["ٱلْمُبْدِئُ", "প্রথমবার সৃষ্টিকর্তা"],
  ["ٱلْمُعِيدُ", "পুনরায় সৃষ্টিকর্তা"],
  ["ٱلْمُحْيِى", "জীবন দানকারী"],
  ["ٱلْمُمِيتُ", "মৃত্যু দানকারী"],
  ["ٱلْحَىُّ", "চিরঞ্জীব"],
  ["ٱلْقَيُّومُ", "সমস্ত কিছুর ধারক ও সংরক্ষণকারী"],
  ["ٱلْقَيُّومُ ", "সমস্ত কিছুর ধারক ও সংরক্ষণকারী"],
  ["ٱلْوَاجِدُ", "অফুরন্ত ভান্ডারের অধিকারী"],
  ["ٱلْمَاجِدُ ", "শ্রেষ্ঠত্বের অধিকারী"],
  ["ٱلْوَاحِدُ  ", "এক ও অদ্বিতীয়"],
  ["ٱلْأَحَد ", "এক"],
  ["ٱلْصَّمَدُ  ", "অমুখাপেক্ষি"],
  ["ٱلْقَادِرُ", "সর্বশক্তিমান"],
  ["ٱلْمُقْتَدِرُ ", "নিরঙ্কুশ সিদ্ধান্তের অধিকারী"],
  ["ٱلْمُقَدِّمُ ", "অগ্রসারক"],
  ["ٱلْمُؤَخِّرُ ", "অবকাশ দানকারী"],
  ["ٱلأَوَّلُ ", "অনাদি"],
  ["ٱلْآخِرُ  ", "অনন্ত,সর্বশেষ"],
  ["ٱلْظَّاهِرُ  ", "সম্পূর্ণরূপে প্রকাশিত"],
  ["ٱلْبَاطِن  ", "দৃষ্টি হতে অদৃশ্য"],
  ["ٱلْوَالِي  ", "সমস্ত কিছুর অভিভাবক"],
  ["ٱلْمُتَعَالِي  ", "সৃষ্টির গুণাবলীর উর্দ্ধে"],
  ["ٱلْبَرُّ  ", "পরম উপকারী"],
  ["ٱلْتَّوَّابُ  ", "তাওবার তৌফিক দানকারী ও কবুলকারী"],
  ["ٱلْمُنْتَقِمُ  ", "প্রতিশোধ গ্রহণকারী"],
  ["ٱلْعَفُوُّ  ", "পরম উদার"],
  ["ٱلْرَّؤُفُ  ", "পরম স্নেহশীল"],
  ["مَالِكُ ٱلْمُلْكُ ", "সমগ্র জগতের বাদশাহ"],
  ["ذُو ٱلْجَلَالِ وَٱلْإِكْرَامُ ", "যুল জালালী  মহিমান্বিত ও দয়াবান সত্তা"],
  ["ٱلْمُقْسِطُ ", "হকদারের হোক আদায়কারী"],
  ["ٱلْجَامِعُ ", "একত্রকারী, সমবেতকারী"],
  ["ٱلْغَنيُّ ", "অমুখাপেক্ষি ধনী"],
  ["ٱلْمُغْنِيُّ ", "পরম অভাবমোচনকারী"],
  ["ٱلْمَانِعُ ", "অকল্যাণরোধক"],
  ["ٱلْضَّارُ ", "ক্ষতিসাধনকারী"],
  ["ٱلْنَّافِعُ ", "কল্যাণকারী"],
  ["ٱلْنُّورُ ", "পরম আলো"],
  ["ٱلْهَادِي ", "পথ প্রদর্শক"],
  ["ٱلْبَدِيعُ ", "অতুলনীয়"],
  ["ٱلْبَاقِي ", "চিরস্থায়ী, অবিনশ্বর"],
  ["لْوَارِثُ ", "উত্তরাধিকারী"],
  ["ٱلْرَّشِيدُ", "সঠিক পথ প্রদর্শক"],
  ["ٱلْصَّبُورُ", "অত্যাধিক ধর্য্য ধারণকারী"]
];

List<List<String>> AjkerAyat = [
  [
    "",
    "“হে ঈমানদারগণ! তোমাদের ওপর সাওম ফরয করা হয়েছে। যেরূপ ফরয করা হয়েছিল তোমাদের পূর্ববর্তী লোকদের ওপর। যেন তোমরা তাকওয়া অর্জন করতে পার।” [সূরা আল-বাকারা, আয়াত: ১৮৩]"
  ],
  ["", "“যে সংশোধিত হলো, সেই সফলকাম হলো”। [সূরা আল-আ‘লা, আয়াত: ১৪]"],
  [
    "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ ",
    "ধৈর্য্যধারণকারীগণই অগণিত সওয়াবের অধিকারী হবে।-সূরা যুমার: ১০"
  ],
  [
    "",
    "আর তিনি দিবা রাত্রিকে পরস্পরের অনুগামী করেছেন। যে উপদেশ গ্রহণ করতে চায় অথবা কৃতজ্ঞ হতে চায় তার জন্য। (সূরা আল ফুরকান, ৬২ আয়াত)।"
  ],
  [
    "اِنَّ اللهَ مَعَ الَّذِیْنَ اتَّقَوْا وَّ الَّذِیْنَ هُمْ مُّحْسِنُوْنَ.",
    "নিশ্চয়ই আল্লাহ তাঁদের সাথে থাকেন, যারা তাকওয়া অবলম্বন করে। -সূরা নাহল : ১২৮"
  ],
  [
    "وَ مَنْ یَّتَّقِ اللهَ یُكَفِّرْ عَنْهُ سَیِّاٰتِهٖ وَ یُعْظِمْ لَهٗۤ اَجْرًا.",
    "যে তাকওয়া অবলম্বন করে আল্লাহ তার গুনাহসমূহ মাফ করে দেন এবং তাকে বিরাট আজর দান করেন। -সূরা ত্বলাক (৬৫) : ৫"
  ],
  [
    "وَاتَّقُوا اللهَ إِنَّ اللهَ غَفُورٌ رَحِيمٌ.",
    "তোমরা আল্লাহকে ভয় করো। নিশ্চয়ই আল্লাহ ক্ষমাশীল দয়ালু। -সূরা আনফাল : ৬৯"
  ],
  [
    "وَ مَنْ یَّتَّقِ اللهَ یَجْعَلْ لَّهٗ مِنْ اَمْرِهٖ یُسْرًا.",
    "যে তাক্বওয়া অবলম্বন করে আল্লাহ তার সব বিষয় সহজ করে দেন। -সূরা ত্বলাক (৬৫) : ৪"
  ],
  [
    "اِنَّ لِلْمُتَّقِیْنَ مَفَازًا.",
    "নিশ্চয়ই মুত্তাকীদের জন্য রয়েছে সফলতা। -সূরা নাবা : ৩১"
  ],
  [
    "وَّ یَرْزُقْهُ مِنْ حَیْثُ لَا یَحْتَسِبُ.",
    "এবং তাকে রিযিক দান করেন অকল্পনীয়ভাবে। -সূরা ত্বালাক : ৩"
  ],
  [
    "اِنَّ اَكْرَمَكُمْ عِنْدَ اللهِ اَتْقٰىكُمْ. ",
    "নিশ্চয়ই আল্লাহর নিকট সবচেয়ে সম্মানিত ব্যক্তি হচ্ছে মুত্তাকীগণ। -সূরা হুজুরত : ১৩"
  ],
  [
    "اِنَّ اللهَ یُحِبُّ الْمُتَّقِیْنَ.",
    "নিশ্চয়ই আল্লাহ মুত্তাকীদেরকে ভালোবাসেন। -সূরা তাওবা : ৪"
  ],
  [
    "اِنَّمَا یَتَقَبَّلُ اللهُ مِنَ الْمُتَّقِیْنَ. ",
    "নিশ্চয়ই আল্লাহ মুত্তাকীদের থেকে কবুল করেন। -সূরা মায়েদা (৫) : ২৭"
  ],
  [
    "وَ الَّذِیْنَ اتَّقَوْا فَوْقَهُمْ یَوْمَ الْقِیٰمَةِ.",
    "যাঁরা তাকওয়া অবলম্বন করে তারা কিয়ামতের দিন তাদের (কাফেরদের) উপরে থাকবে। -সূরা বাকারা (২) : ২১২"
  ],
  [
    "فَمَنِ اتَّقٰی وَ اَصْلَحَ فَلَا خَوْفٌ عَلَیْهِمْ وَ لَا هُمْ یَحْزَنُوْنَ. ",
    "যারা তাকওয়া অবলম্বন করে এবং সৎ থাকে, তাদের কোনো ভয় নেই এবং তারা কখনো দুঃখিত হবে না। -সূরা আরাফ (৮) : ৩৫"
  ],
  [
    "اِنَّ الْمُتَّقِیْنَ فِیْ جَنّٰتٍ وَّ نَهَرٍ،  فِیْ مَقْعَدِ صِدْقٍ عِنْدَ مَلِیْكٍ مُّقْتَدِرٍ.",
    "যারা তাকওয়া অবলম্বন করেছে তারা থাকবে উদ্যানরাজি ও নহরে। সত্যিকারের মর্যাদাপূর্ণ আসনে, সর্বময় ক্ষমতার অধিকারী মহা সম্রাটের সান্নিধ্যে। -সূরা ক্বমার (৫৪) : ৫৪-৫৫"
  ],
  [
    "",
    "আর সিয়াম পালন করাই তোমাদের জন্যে অধিকতর কল্যাণকর যদি তোমরা তা জানতে। (সূরা বাকারাহ-১৮৪)"
  ],
  [
    "",
    "তোমরা নামায প্রতিষ্ঠা কর এবং যাতাক দাও । তোমরা নিজের জন্যে পূর্বে যে সৎ কর্ম প্রেরন করবে, তা আল্লাহ্‌র কাছে পাবে । তোমরা যা কিছু কর, নিশ্চয় আল্লাহ্‌ তা প্রত্যক্ষ করেন ।\n— সূরা আল বাকারা, আয়াতঃ ১১০"
  ],
  [
    "",
    "হে মুমিন গন ! তোমরা ধৈর্য ও নামাযের মাধ্যমে সাহায্য প্রার্থনা কর । নিশ্চিতই আল্লাহ্‌ ধৈর্যশীলদের সাথেই রয়েছেন ।\n— সূরা আল বাকারা, আয়াতঃ ১৫৩"
  ],
  [
    "",
    "সমস্ত নামাযের প্রতি যত্নবান হও, বিশেষ করে মধ্যবর্তী নামাযের ব্যাপারে । আর আল্লাহ্‌র সামনে একান্ত আদবের সাথে দাঁড়াও ।\n— সূরা আল বাকারা, আয়াতঃ ২৩৮"
  ],
  [
    "",
    "হে বনী আদম ! তোমরা প্রত্যেক নামাযের সময় সাজসজ্জা পরিধান করে নাও, খাও ও পান কর এবং অপব্যয় করো না । তিনি অপব্যয়ীদের কে পছন্দ করেন না ।\n— সূরা আল আরাফ, আয়াতঃ ৩১"
  ],
  [
    "",
    "আর যেসব লোক সুদৃঢ় ভাবে কিতাবকে আঁকড়ে থাকে এবং নামায প্রতিষ্ঠা করে নিশ্চয় আমি বিনষ্ট করবো না সৎ কর্মীদের সওয়াব ।\n— সূরা আল আরাফ, আয়াতঃ ১৭০"
  ],
  [
    "",
    "আমিই আল্লাহ্‌ আমি ব্যতীত কোন ইলাহ নেই । অতএব আমার এবাদত কর এবং আমার স্মরণার্থে নামায কায়েম কর ।\n— সূরা তোয়া-হা, আয়াতঃ ১৪"
  ],
  [
    "",
    "নামায কায়েম কর, যাকাত প্রদান কর এবং রসূলদের আনুগত্য কর যাতে তোমরা অনুগ্রহ প্রাপ্ত হও ।\n— সূরা আন নূর, আয়াতঃ ৫৬"
  ],
  [
    "",
    "সবাই তার অভিমুখী হও এবং ভয় কর, নামায কায়েম কর এবং মুশরিকদের অন্তর্ভুক্ত হয়ো না ।\n— সূরা আর রুম, আয়াতঃ ৩১"
  ],
  [
    "",
    "হে বতসো, নামায কায়েম কর, সৎকাজে আদেশ দাও, মন্দকাজে নিষেধ কর এবং বিপদ আপদে সবর কর । নিশ্চয় এটা সাহসিকতার কাজ ।\n— সূরা লোকমান, আয়াতঃ ১৭"
  ],
  [
    "",
    "যারা আল্লাহ্‌র কিতাব পাঠ করে, নামায কায়েম করে, এবং আমি যা দিয়েছি তা থেকে গোপনে ও প্রকাশ্যে ব্যয় করে, তারা এমন ব্যবসা আশা কর, যাতে কখনও লোকসান হবে না ।\n— সূরা ফাতির, আয়াতঃ ২৯"
  ],
  [
    "",
    "মুমিন গণ, জুমআর দিনে যখন নামাজের আজান দেয়া হয়, তখন তোমরা আল্লাহ্‌র স্মরণের পানে তরা কর এবং বেচাকেনা বন্ধ কর । এটা তোমাদের জন্যে উত্তম যদি তোমরা বুঝ ।\n— সূরা আল জুমুআ, আয়াতঃ ৯"
  ],
  [
    "",
    "এ দুনিয়া রং তামাশা ছাড়া কিছুই নয়, আর নিশ্চয়ই আখেরাতের আবাসই হলো প্রকৃত জীবন যদি তারা জানত।- সূরা আনকাবূতঃ৬৪"
  ],
  [
    "",
    "যে ব্যক্তি ইসলাম ব্যতীত অন্য ধর্মে যেতে চাইবে তার সে ধর্ম কবুল হবে না এবং আখেরাতে সে ব্যক্তি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হবে। সূরা ইমরানঃ৮৫"
  ],
];
List<String> AjkerHadith = [
  "হযরত আবু হুরায়রা (রা.) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ (স:) ইরশাদ করেন, তোমাদের নিকট রমজান মাস উপস্থিত। এটা এক অত্যন্ত বরকতময় মাস। আল্লাহ তা’য়ালা এ মাসে তোমাদের প্রতি সাওম ফরজ করেছেন। এ মাসে আকাশের দরজাসমূহ উন্মুক্ত হয়ে যায়, এ মাসে জাহান্নামের দরজাগুলো বন্ধ করে দেওয়া হয় এবং এ মাসে বড় বড় শয়তানগুলোকে আটক রাখা হয়। আল্লাহর জন্যে এ মাসে একটি রাত আছে, যা হাজার মাসের চেয়েও অনেক উত্তম। যে লোক এ রাত্রির মহা কল্যাণলাভ হতে বঞ্চিত থাকল, সে সত্যিই বঞ্চিত ব্যক্তি। (সুনানুন নাসায়ী:২১০৬)",
  " যে ব্যক্তি পরিপূর্ণ বিশ্বাস ও পর্যালোচনাসহ রমজান মাসের সিয়াম পালন করবে, তার পূর্ববর্তী ও পরবর্তী গুণাহ মাফ করে দেওয়া হবে। (সহীহ বুখারী: ৩৮, সহীহ মুসলিম: ৭৬০)",
  "মানুষের প্রত্যেক আমলের প্রতিদান বৃদ্ধি করা হয়। একটি নেকীর সওয়াব দশ গুণ থেকে সাতাশ গুণ পর্যন্ত। আল্লাহ তাআলা ইরশাদ করেন, কিন্তু রোযা আলাদা। কেননা তা একমাত্র আমার জন্য এবং আমি নিজেই এর বিনিময় প্রদান করব। বান্দা একমাত্র আমার জন্য নিজের প্রবৃত্তিকে নিয়ন্ত্রণ করেছে এবং পানাহার পরিত্যাগ করেছে।-সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৪); মুসনাদে আহমদ, হাদীস : ৯৭১৪; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৮৭; সুনানে ইবনে মাজাহ, হাদীস : ১৬৩৮,"
      "‘প্রত্যেক ইবাদতই ইবাদতকারী ব্যক্তির জন্য, পক্ষান্তরে রোযা আমার জন্য। আমি নিজেই এর প্রতিদান দিব। (সহীহ বুখারী হাদীস-১৯০৪)",
  "আল্লাহ তাআলা বলেন, রোযা আমার জন্য, আমি নিজেই এর প্রতিদান দিব। কেয়ামতের দিন রোযাদারদের জন্য একটি বিশেষ পানির হাউজ থাকবে, যেখানে রোযাদার ব্যতীত অন্য কারো আগমন ঘটবে না।-মুসনাদে বাযযার, হাদীস : ৮১১৫;  মাজমাউয যাওয়াইদ, হাদীস : ৫০৯৩",
  "হযরত হুযায়ফা রা. বলেন, আমি আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমার বুকের সাথে মিলিয়ে নিলাম, তারপর তিনি বললেন, যে ব্যক্তি লাইলাহা ইল্লাল্লাহু’ বলে মৃত্যুবরণ করবে সে জান্নাতে প্রবেশ করবে, যে ব্যক্তি আল্লাহর সন্তুষ্টি কামনায় একদিন রোযা রাখবে, পরে তার মৃত্যু হয় সে জান্নাতে প্রবেশ করবে। যে ব্যক্তি আল্লাহর সন্তুষ্টির উদ্দেশ্যে কোনো দান-সদকা করে তারপর তার মৃত্যু হয়, সে জান্নাতে প্রবেশ করবে।-মুসনাদে আহমদ, হাদীস : ২৩৩২৪; মুসনাদে বাযযার, হা.২৮৫৪",
  "জান্নাতে একটি দরজা আছে, যার নাম রাইয়ান। কিয়ামতের দিন এ দরজা দিয়ে কেবল রোযাদার ব্যক্তিরাই প্রবেশ করবে। অন্য কেউ প্রবেশ করতে পারবে না। ঘোষণা করা হবে- কোথায় সেই সৌভাগ্যবান রোযাদারগণ? তখন তারা উঠে দাড়াবে। তারা ব্যতীত কেউ এ দরজা দিয়ে প্রবেশ করতে পারবে না। অতঃপর রোযাদারগণ যখন প্রবেশ করবে, তখন তা বন্ধ করে দেওয়া হবে। ফলে কেউ ঐ দরজা দিয়ে প্রবেশ করতে পারবে না।-সহীহ বুখারী, হাদীস : ১৮৯৬; সহীহ মুসলিম, হাদীস : ১১৫২; মুসনাদে আহমদ, হাদীস : ২২৮১৮",
  "জান্নাতে রোযাদার ব্যক্তিদের জন্য একটি বিশেষ দরজা আছে, যার নাম রাইয়ান। রোযাদারগণ ছাড়া অন্য কেউ এই দরজা দিয়ে প্রবেশ করতে পারবে না। যখন সর্বশেষ রোযাদার ব্যক্তি তাতে প্রবেশ করবে, তখন সেই দরজা বন্ধ করে দেওয়া হবে। যে ব্যক্তি ঐ দরজা দিয়ে প্রবেশ করবে, সে (জান্নাতের পানীয়) পান করবে। আর যে পান করবে, সে কখনো পিপাসার্ত হবে না।-মুসনাদে আহমদ, হাদীস : ২২৮৪২; সহীহ ইবনে খুযায়মা, হাদীস : ১৯০২; সুনানে তিরমিযী, হাদীস : ৭৬৫; সুনানে নাসায়ী, হাদীস : ২৫৪৪",
  "আমাদের মহান রব ইরশাদ করেছেন- রোযা হল ঢাল। বান্দা এর দ্বারা নিজেকে জাহান্নামের আগুন থেকে রক্ষা করবে। রোযা আমার জন্য আর আমিই এর পুরস্কার দিব।-মুসনাদে আহমদ, হাদীস : ১৪৬৬৯; শুয়াবুল ঈমান বাইহাকী, হাদীস : ৩৫৭০",
  "الصيام جنة من النار كجنة احدكم من القتال، \nরোযা হল জাহান্নাম থেকে রক্ষাকারী ঢাল, যুদ্ধক্ষেত্রে তোমাদের (শত্রুর আঘাত হতে রক্ষাকারী) ঢালের মত।-মুসনাদে আহমদ, হাদীস : ১৬২৭৮; সহীহ ইবনে খুযাইমা, হাদীস : ২১২৫; সহীহ ইবনে হিববান, হাদীস : ৩৬৪৯; সুনানে ইবনে মাজাহ, হাদীস : ১৬৩৯",
  "من صام رمضان ايمانا واحتسابا غفر له ما تقدم من ذنبه، \nযে ব্যক্তি ঈমানের সাথে সওয়াবের আশায় রমযান মাসের রোযা রাখবে, তার পূর্ববর্তী গুনাহসমূহ ক্ষমা করে দেওয়া হবে।- সহীহ বুখারী, হাদীস : ৩৮, ২০১৪; সহীহ মুসলিম ৭৬০(১৬৫); মুসনাদে আহমদ, হাদীস : ৭১৭০; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৬৮",
  " আল্লাহ তাআলা তোমাদের উপর রমযানের রোযা ফরয করেছেন, আর আমি কিয়ামুল লাইল অর্থাৎ তারাবীহ’র নামাযকে সুন্নত করেছি। সুতরাং যে ব্যক্তি ঈমানের সাথে সওয়াবের আশায় রমযানের সিয়াম ও কিয়াম আদায় করবে, সে ঐ দিনের মতো নিষ্পাপ হয়ে যাবে যেদিন সে মায়ের গর্ভ থেকে সদ্যভূমিষ্ঠ হয়েছিল।-মুসনাদে আহমদ, হাদীস-১৬৬০, মুসান্নাফে ইবনে আবি শাইবা, হাদীস-৭৭৮৭, মুসনাদে বাযযার, হাদীস-১০৪৮, সহীহ ইবনে খুযাইমা, হাদীস-২২০১, সুনানে নাসায়ী, হাদীস-২৫১৮"
      "والذى نفس محمد بيده لخلوف فم الصائم اطيب عند الله من ريح المسك، \nসেই সত্তার শপথ, যার হাতে মুহাম্মাদের জীবন, রোযাদারের মুখের দুর্গন্ধ আল্লাহর নিকট মিশকের সুগন্ধির চেয়েও অধিক সুগন্ধিময়।-সহীহ বুখারী, হাদীস : ১৯০৪; সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৩); মুসনাদে আহমদ, হাদীস : ৭১৭৪; সুনানে নাসায়ী, হাদীস : ২৫২৩; সুনানে ইবনে মাজাহ- ১৬৩৮",
  "রোযাদারের জন্য দুটি আনন্দের মুহূর্ত রয়েছে, যখন সে আনন্দিত হবে। এক. যখন সে ইফতার করে তখন ইফতারের কারণে আনন্দ পায়। দুই. যখন সে তার রবের সাথে মিলিত হবে তখন তার রোযার কারণে আনন্দিত হবে। অন্য বর্ণনায় রয়েছে, যখন সে আল্লাহর সাথে মিলিত হবে, আর তিনি তাকে পুরস্কার দিবেন, তখন সে আনন্দিত হবে।-সহীহ বুখারী, হাদীস : ১৯০৪, ১৮৯৪; সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৩, ১৬৪, ১৬৫); মুসনাদে আহমদ, হাদীস : ৯৪২৯, ৭১৭৪; সুনানে তিরমিযী, হাদীস : ৭৬৬",
  "ইফতারের সময় রোযাদার যখন দুআ করে, তখন তার দুআ ফিরিয়ে দেওয়া হয় না। (অর্থাৎ তার দুআ কবুল হয়)।-সুনানে ইবনে মাজাহ, হাদীস : ১৭৫৩",
  "রোযাদারের দুআ ফিরিয়ে দেওয়া হয় না।-মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৯৫"
];

List<String> SalafQoutes = [
  "হযরত আলী রা. বলেন- যে ব্যক্তি ইচ্ছাকৃতভাবে রমযান মাসের একটি রোযা ভঙ্গ করবে, সে আজীবন সেই রোযার (ক্ষতিপূরণ) আদায় করতে পারবে না।-[মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৯৮৭৮]",
  "হযরত আব্দুল্লাহ ইবনে মাসউদ রা. বলেন, যে ব্যক্তি অসুস্থতা ও সফর ব্যতীত ইচ্ছাকৃতভাবে রমযানের একটি রোযাও ভঙ্গ করে, সে আজীবন রোযা রাখলেও ঐ রোযার হক আদায় হবে না।[মুসান্নাফে ইবনে আবী শাইবা : ৯৮৯৩; মুসান্নাফে আব্দুর রাযযাক : ৭৪৭৬; সহীহ বুখারী ৪/১৬০]",
  "জ্ঞানের ভিত্তি হলো মহান আল্লাহর প্রতি ভয় (তাকওয়া)।\n— ইমাম আহমাদ ইবনে হাম্বল (রাহিমাহুল্লহ)",
  "আল্লাহকে ভয় করো, কারণ যে তাকে ভয় করে সে কখনো একাকীত্ব অনুভব করে নাহ।\n— উমর ইবনুল খাত্তাব (রাঃ)",
  "কোন ব্যক্তির তাকওয়া (আল্লাহভীতি) না থাকলে সে যদি বিবাহিত হয় তবুও দৃষ্টিকে সংযত করে না। তাকওয়াসম্পন্ন মানুষ যদি অবিবাহিতও থাকে, সে তার দৃষ্টিকে সংযত করে।\n— ওমর সুলাইমান",
  "একজন মানুষের অন্তর যদি রোগগ্রস্ত না হয় তাহলে সে কোনদিন, কোন অবস্থাতেই আল্লাহ সুবহানাহু ওয়া তা’আলা ছাড়া অন্য কাউকে ভয় পাবে না\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "আপনি যখন কোন সৃষ্টিকে ভয় করবেন তখন তার থেকে দূরে পালাতে চেষ্টা করবেন। আপনি যখন আল্লাহকে ভয় করবেন তখন তাকে ভালোবাসবেন এবং তার সাথে ঘনিষ্ট হওয়ার চেষ্টা করবেন।\n— ইমাম ইবনুল কাইয়্যিম (রহিমাহুল্লহ)",
  " যাকে আল্লাহভীতি দান করে সম্মানিত করা হয়নি তার আর কোনো সম্মানই নেই।\n— ইমাম শাফেয়ী (রহঃ)",
  " আল্লাহর প্রত্যেকটি ফয়সালাই ন্যায়বিচারের ওপর ভিত্তিশীল। সুতরাং কোন অবস্থাতেই অভিযোগের ভাষা যেন তোমার মুখে উচ্চারিত না হয়।\n— ইমাম গাজ্জালী (রহঃ)",
  "নিজেকে আল্লাহর রাহমাতসমূহের কথা বেশি করে স্মরণ করিয়ে দিন, কেননা যিনি বেশি বেশি স্মরণ করেন তার কৃতজ্ঞতা প্রকাশ করার সম্ভাবনাও বেশি থাকে।\n— উমার বিন আবদুল আজিজ (রাহিমাহুল্লাহ)",
  " তোমরা কি আমাকে দারিদ্রতার কথা ভাবিয়ে ভয় দেখাতে চেষ্টা করছ যখন যে একমাত্র বিষয় সুফিয়ান ভয় করে তা হলো এই দুনিয়ার সম্পদ তার উপরে ঢেলে দেয়া হবে\n— ইমাম সুফিয়ান আস-সাওরি (রহঃ)",
  " সে-ই প্রকৃত পুরুষ যে আল্লাহর জন্য কাঁদে।\n— ওমর সুলাইমান",
  "কারো সাথে কথোপকথনে বিনয়ী হওয়াটা একজন ব্যক্তির জন্য আবশ্যক।\n— ইমাম আল-কুরতুবী (রহিমাহুল্লাহ)",
  "কোনো ভাল কাজকে কখনই ছোট করবেন না, কারণ আপনি জানেন না কোন হাসানাহ আপনার জান্নাতের টিকিট হবে। -মুহাম্মদ নুসাইর",
  "আমরা দুনিয়ার ভোগ বিলাসের জন্য দোয়া করি। যখন রহমতের দরজা খোলা হয় না তখন আমরা কান্নায় ভেঙে পড়ি। আমরা বুঝি না আমাদের জন্য আল্লাহ জান্নাতের দরজা খুলে দিয়েছেন। -ইয়াসমিন মোগাহেদ",
  "মানুষকে সৃষ্টি করা হয়েছে আখেরাতের জন্য, দুনিয়ার জন্য নয়। \nসংগৃহীত",
  "দুনিয়াতে সামান্য কিছুর জন্য আখেরাতকে ভুলে যেও না। \nসংগৃহীত",
  "আমাদের জীবন আমাদের জন্য নয়, আমাদের জীবন আল্লাহর জন্য। \nসংগৃহীত",
  "দুনিয়ার নেয়ামত অল্প এবং আখেরাতের নেয়ামত অফুরন্ত। \nসংগৃহীত",
  "দুনিয়া এমন একটি নদী যার যাত্রী তারাই যার তীরে আখেরাত এবং যার নৌকা তাকওয়া। \nসংগৃহীত",
  "এই জীবনের মাধুর্য পাওয়া যায় আল্লাহকে স্মরণে; আখেরাতের মাধুর্য পাওয়া যায় তাকে দর্শনে। \nইয়াসির কাদি",
  "সাহাবাদের অন্তরে দুনিয়ার উপস্থিতি ছিলো শূন্য কিন্তু তাতে আখেরাত ছিলো পরিপূর্ণ।\n ইবনে রজব আল হানবলী",
  "দুনিয়া নিয়ে দুঃশ্চিন্তা করা অন্তর অন্ধকারাচ্ছন্ন, আর আখেরাত নিয়ে দুঃশ্চিন্তা করা অন্তর আলোকিত। \nহযরত উসমান (রাঃ)",
  "দুনিয়ার প্রেমে আল্লাহকে পাওয়া যায় না, কিন্তু আল্লাহর প্রেমে দুনিয়া ও আখেরাত উভয়ই পাওয়া যায়। \nসংগৃহীত",
  "যে নিজেকে স্মার্ট দাবি করে কিন্তু আখেরাতের দিকে মনোযোগ দেয় না, সে মিথ্যা বলছে। ওয়াহব ইবনে মুনাবীহ (রঃ)",
  "যেসব পাপ কাজ তোমরা গোপনে করে থাকো সেগুলোকে ভয় করো, কেননা সেসব পাপের সাক্ষী বিচারক স্বয়ং নিজেই ।\n— আলী ইবনে আবু তালিব (রাঃ)",
  "পাপ কাজ গুলো মানুষের চেহারাকে কুৎসিত করে দেয় ।\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "কল্যানপ্রাপ্ত তো সেই ব্যক্তি যার নিজের পাপ সমূহ তাকে অন্যদের পাপের দিকে অঙ্গুলি নির্দেশ থেকে বিরত রাখে ।\n— আলী ইবনে আবু তালিব (রাঃ)",
  "ঈমানদারদের জীবন ক্রমাগত বিভিন্ন কঠিন পরীক্ষার মুখােমুখি করানাে হয় তাদের ঈমানকে বিশুদ্ধ এবং তাদের পাপকে মােচন করানাের জন্য। কারণ, ঈমানদারগণ তাদের জীবনের প্রতিটি কাজ করেন কেবলমাত্র আল্লাহর সন্তুষ্টির জন্য; আর তাই জীবনে সহ্য করা এই দুঃখ-কষ্টগুলাের জন্য তাদের পুরষ্কার দেয়া আল্লাহর জন্য অপরিহার্য হয়ে যায়।\n— ইমাম ইবনে তাইমিয়া (রহঃ)"
      "পাপ হলাে শেকলের মতন যা পাপকারীকে আটকে রাখে যেন সে তাওহীদের বিশাল বাগানে বিচরণ করতে এবং সেখানকার ফল সৎকর্মসমূহকে সংগ্রহ করতে না পারে।\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "পাপকাজের অনেক পার্শ্বপ্রতিক্রিয়া রয়েছে, তার মধ্যে একটি হলাে তা আপনার কাছ থেকে জ্ঞান। ছিনিয়ে নেবে।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)",
  "আমাদের পুর্ব প্রজন্মের একজন মানুষ বলেছিলেন, খারাপ কাজের একটি শাস্তি হলাে আরাে খারাপ কাজ হওয়া এবং ভালাে কাজের একটি পুরষ্কার হলাে আরাে ভালাে কাজ হওয়া ।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)"
      "প্রতিটি পাপ আরাে অনেক পাসের জন্ম দেয়, একটি পাপ আরেকটি পাপের দিকে নিয়ে যেতে থাকে যতক্ষণ না পর্যন্ত সেই পাপরাশি মানুষটিকে এমনভাবে কাবু করে ফেলে যে কৃত পাপগুলাের জন্য তাওবা করাকে তার কাছে কঠিন বলে মনে হয়।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)"
      "একজন পাপাচারী লােক তার পাপের জন্য অনুতপ্ত হয়না। কারণ তার অন্তর ইতােমধ্যেই মরে গেছে ।\n— ইমাম ইবনুল কাইয়্যিম (ব্রাহিমাহুল্লাহ)",
  " যে ভালাে কাজের ফলে অন্তরে অহংকার সৃষ্টি হয় তার চাইতে যে পাপের জন্য কোন ব্যক্তি আল্লাহর কাছে তার আত্মাকে সমর্পিত করে সেটি আল্লাহর কাছে বেশি পছন্দের ।\n— ইমাম ইবনুল  কাইয়্যিম (রাহিমাহুল্লাহ)",
  " আয়নায় নিজের চেহারা দেখ, যদি সুদর্শন হও তবে পাপের কালিমা লেপন করে ওকে কুৎসিত করাে ! আর যদি কালাে-কুশ্রী হয়ে থাক, তবে ওকে পাপ-পঙ্কিলতা মেখে আরও বীভৎস করে তুলাে না।\n— ইমাম গজ্জালী (রহঃ)",
  "আমি এমন মানুষদের (সাহাবা) সান্নিধ্য অর্জন করেছিলাম যারা তাদের কোন সৎকাজকে ছেড়ে দেয়া যতটা ভয় করতেন তা তােমরা তােমাদের পাপকাজের পরিণামকে যতটুকু ভয় কর তার চাইতেও বেশি।\n— আল হাসান আল-বামী (রাহিমাহুল্লাহ)",
  "কোন পাপ করার জন্য আপনার কামনা যত বড় হবে, সেই পাপকে এড়িয়ে গেলে আপনার ঈমান তত বড় হবে।\n— সালিহ আল-উমাইমিন (রহিমাহুল্লাহ)",
  "যদি আকাঙ্ক্ষা করেন আপনার সম্পদ বৃদ্ধি হােক এবং আপনার পাপগুলাে ক্ষমা হোক, তাহলে আপনার সাদাকাহ (দান) করা উচিত।\n— সালিহ আল-উসাইমিন (রহিমাহুল্লাহ)",
  "জঘন্য পাপগুলাের একটি হলাে যখন একজন মানুষ তার অপর ভাইকে বলে, “আল্লাহকে ভয় করাে” এবং সে তার জবাবে বলে, “তােমার নিজেকে নিয়ে চিন্তা করাে।\n— আব্দুল্লাহ বিন মাসউদ (রাদিয়াল্লাহু আনহু)",
  " সন্তানদের জন্য বিয়েকে সহজ করে দেয়া আমাদের জন্য ইবাদাত স্বরূপ৷ আর তাদের জন্য বিয়েকে কঠিন করে ফেলা একটি পাপ, যা অন্যান্য আরাে অনেক পাসের জন্ম দেয়।\n— ইসমাইল ইবন মুসা ",
  "‘সন্দেহ নেই, মৃত্যু অনেক বড় মুসিবত। কিন্তু তারচেয়েও বড় মুসিবত হলো, মৃত্যু সম্পর্কে গাফেল হওয়া ও মৃত্যুর জন্যে আমল না করা।’\n–ইমাম কুরতুবি (রহিমাহুল্লহ)",
];
