// List<Map<String, dynamic>> Isha_Items = [
//   {
//     'id': 1,
//     'title': 'ইশার আজানের জবাব',
//     'subTitle':
//         "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
//     'isChecked': false
//   },
//   {
//     'id': 2,
//     'title': "তাহিয়্যাতুল মাসজিদ",
//     'subTitle':
//         "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
//     'isChecked': false
//   },
//   {
//     'id': 3,
//     'title': "ইশার ৪ রাকা'আত ফরজ",
//     'subTitle':
//         "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
//     'isChecked': false
//   },
//   {
//     'id': 4,
//     'title': "ইশার পর আয়াতুল কুরসি",
//     'subTitle':
//         "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
//     'isChecked': false
//   },
//   {
//     'id': 5,
//     'title':
//         'ইশার পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার',
//     'subTitle':
//         "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
//     'isChecked': false
//   },
//   {
//     'id': 6,
//     'title':
//         "ইশার পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
//     'subTitle':
//         "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
//     'isChecked': false
//   },
//   {
//     'id': 7,
//     'title': "ইশার ২ রাকা'আত সুন্নত ",
//     'subTitle':
//         "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
//     'isChecked': false
//   },
//   {
//     'id': 8,
//     'title': "তারাবীহ ২০ রাকা'আত",
//     'subTitle':
//         "যে ব্যক্তি ঈমান অবস্থায় সাওয়াবের আশায় রাতে তারাবীহ ও তাহাজ্জুদ আদায় করবে, আল্লাহ তাঁর পূর্ববতী (সগীরা) গুনাহগুলো মাফ করে দেবেন। [বুখারী :৩৭, মুসলিম :৭৫৯]",
//     'isChecked': false
//   },
//   {
//     'id': 9,
//     'title': "বিতর ৩ রাকা'আত",
//     'subTitle': "বিতর নামাজ পড়া ওয়াজীব। না পড়লে গুনাহ হবে।",
//     'isChecked': false
//   },
//   {
//     'id': 10,
//     'title': "তাহাজ্জুদ আদায়",
//     'subTitle':
//         "ফরয সালাতের পর সর্বোত্তম সালাত হল রাতের সালাত (অর্থাৎ তাহাজ্জুদের সালাত)। [মুসলিম : ১১৬৩]\n তোমাদের তাহাজ্জুদের নামাজ আদায় করা উচিত। কেননা তা তোমাদের পূর্বেকার সজ্জন ব্যক্তিদের প্রতীক এবং তোমাদের প্রতিপালকের নৈকট্য লাভের বিশেষ মাধ্যম। নামাজ গোনাহসমূহ বিমোচনকারী এবং গোনাহের প্রতিবন্ধক। [তিরমিজি: ৩৫৪৯, সহিহ ইবনে খুজাইমা: ১০৭৫]",
//     'isChecked': false
//   },
//   {
//     'id': 11,
//     'title': "সেহরি খাওয়া",
//     'subTitle':
//         " তোমরা সেহরি খাও, কারণ সেহরিতে বরকত রয়েছে[বুখারি-১৯২৩]\n নবী করীম (স.) আমাদের ও ইহুদী-নাসারাদের রোজার পার্থক্য হলো সেহরি খাওয়া, এক ঢুক পানি দিয়ে হলেও সেহরি গ্রহণ করো।[মুসলিম ২৬০৪]",
//     'isChecked': false
//   },
//   {
//     'id': 12,
//     'title': "খেজুর দিয়ে সেহরি খাওয়া",
//     'subTitle':
//         "আবূ হুরাইরাহ (রা.) সূত্রে বর্ণিত। নবী (স) বলেনঃ ঈমানদার ব্যক্তির জন্য খেজুর দিয়ে সাহারী খাওয়া কতোই না উত্তম![সুনান আবূ দাউদ ২৩৪৫]",
//     'isChecked': false
//   },
// ];

class IshaObj {
  String IshaTableName = 'Isha';
  String columnId = 'id';
  String columnDate = 'Date';
  String column_Azan_Reply = 'Azan_Reply';
  String column_Tahiyatul_Mosjid = 'Tahiyatul_Mosjid';
  String column_4_Rakat_Fard = 'Four_Rakat_Fard';
  String column_Ayatul_Kursi = 'Ayatul_Kursi';
  String column_33_Tashbih = 'Thirty_Three_Tashbih';
  String column_10_Tashbih = 'Ten_Tashbih';
  String column_2_Rakat_Sunnah = 'Two_Rakat_Sunnah';
  String column_witr = 'Witr';
  String column_Subhanil_Malikil_Quddus = 'Subhanil_Malikil_Quddus';
}

IshaObj isha = IshaObj();

List<Map<String, dynamic>> Isha_Items = [
  {
    'id': isha.column_Azan_Reply,
    'title': 'ইশার আজানের জবাব',
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false,
    'points': 50
  },
  {
    'id': isha.column_Tahiyatul_Mosjid,
    'title': "তাহিয়্যাতুল মাসজিদ",
    'subTitle':
        "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
    'isChecked': false,
    'points': 50
  },
  {
    'id': isha.column_4_Rakat_Fard,
    'title': "ইশার ৪ রাকা'আত ফরজ",
    'subTitle':
        "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
    'isChecked': false,
    'points': 190
  },
  {
    'id': isha.column_Ayatul_Kursi,
    'title': "ইশার পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false,
    'points': 90
  },
  {
    'id': isha.column_33_Tashbih,
    'title':
        'ইশার পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার',
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false,
    'points': 85
  },
  {
    'id': isha.column_10_Tashbih,
    'title':
        "ইশার পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false,
    'points': 80
  },
  {
    'id': isha.column_2_Rakat_Sunnah,
    'title': "ইশার ২ রাকা'আত সুন্নত ",
    'subTitle':
        "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
    'isChecked': false,
    'points': 100
  },

  {
    'id': isha.column_witr,
    'title': "বিতর ৩ রাকা'আত",
    'subTitle': "বিতর নামাজ পড়া ওয়াজীব। না পড়লে গুনাহ হবে।",
    'isChecked': false,
    'points': 160
  },

  {
    'id': isha.column_Subhanil_Malikil_Quddus,
    'title': "Subhanal-Malikil-Quddus 3 Times",
    'subTitle':
        "Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times[Sunan an-Nasa'i 1740]",
    'isChecked': false,
    'points': 90
  },
  // {
  //   'id': 10,
  //   'title': "তাহাজ্জুদ আদায়",
  //   'subTitle':
  //       "ফরয সালাতের পর সর্বোত্তম সালাত হল রাতের সালাত (অর্থাৎ তাহাজ্জুদের সালাত)। [মুসলিম : ১১৬৩]\n তোমাদের তাহাজ্জুদের নামাজ আদায় করা উচিত। কেননা তা তোমাদের পূর্বেকার সজ্জন ব্যক্তিদের প্রতীক এবং তোমাদের প্রতিপালকের নৈকট্য লাভের বিশেষ মাধ্যম। নামাজ গোনাহসমূহ বিমোচনকারী এবং গোনাহের প্রতিবন্ধক। [তিরমিজি: ৩৫৪৯, সহিহ ইবনে খুজাইমা: ১০৭৫]",
  //   'isChecked': false
  // },
  // {
  //   'id': 11,
  //   'title': "সেহরি খাওয়া",
  //   'subTitle':
  //       " তোমরা সেহরি খাও, কারণ সেহরিতে বরকত রয়েছে[বুখারি-১৯২৩]\n নবী করীম (স.) আমাদের ও ইহুদী-নাসারাদের রোজার পার্থক্য হলো সেহরি খাওয়া, এক ঢুক পানি দিয়ে হলেও সেহরি গ্রহণ করো।[মুসলিম ২৬০৪]",
  //   'isChecked': false
  // },
  // {
  //   'id': 12,
  //   'title': "খেজুর দিয়ে সেহরি খাওয়া",
  //   'subTitle':
  //       "আবূ হুরাইরাহ (রা.) সূত্রে বর্ণিত। নবী (স) বলেনঃ ঈমানদার ব্যক্তির জন্য খেজুর দিয়ে সাহারী খাওয়া কতোই না উত্তম![সুনান আবূ দাউদ ২৩৪৫]",
  //   'isChecked': false
  // },
];
